tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
#include "web/IrrigationWeb.h"

#include <Arduino.h>
#include <Esp32Base.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

#include "Version.h"
#include "domain/BusinessEventLog.h"
#include "domain/FlowCalibration.h"
#include "domain/FlowMeter.h"
#include "domain/MaintenanceService.h"
#include "domain/PlanExecutionTracker.h"
#include "domain/SafetyManager.h"
#include "domain/ZoneManager.h"
#include "storage/PlanStore.h"
#include "storage/RecordStore.h"
#include "storage/ScheduleSkipStore.h"
#include "storage/SystemConfigStore.h"
#include "storage/WeatherSnapshotStore.h"
#include "storage/ZoneConfigStore.h"
#include "storage/ZoneErrorStore.h"

namespace {

void writeUInt(uint32_t value) {
    char text[16];
    snprintf(text, sizeof(text), "%lu", static_cast<unsigned long>(value));
    Esp32BaseWeb::sendChunk(text);
}

void writeInt(int32_t value) {
    char text[16];
    snprintf(text, sizeof(text), "%ld", static_cast<long>(value));
    Esp32BaseWeb::sendChunk(text);
}

void writeBool(bool value) {
    Esp32BaseWeb::sendChunk(value ? "true" : "false");
}

void beginJson(int code = 200) {
    (void)Esp32BaseWeb::beginResponse(code, "application/json", nullptr);
}

void endJson() {
    Esp32BaseWeb::endResponse();
}

void sendError(int code, const char* error) {
    beginJson(code);
    Esp32BaseWeb::sendChunk("{\"ok\":false,\"error\":\"");
    Esp32BaseWeb::writeJsonEscaped(error ? error : "error");
    Esp32BaseWeb::sendChunk("\"}");
    endJson();
}

void sendOk() {
    Esp32BaseWeb::sendJson(200, "{\"ok\":true}");
}

void sendMethodNotAllowed(const char* allowed) {
    beginJson(405);
    Esp32BaseWeb::sendChunk("{\"ok\":false,\"error\":\"method_not_allowed\",\"allowed\":\"");
    Esp32BaseWeb::writeJsonEscaped(allowed);
    Esp32BaseWeb::sendChunk("\",\"method\":\"");
    Esp32BaseWeb::writeJsonEscaped(Esp32BaseWeb::currentMethodName());
    Esp32BaseWeb::sendChunk("\"}");
    endJson();
}

bool rejectFactoryResetPending() {
    if (!MaintenanceService::factoryResetPending()) {
        return false;
    }
    sendError(409, "factory_reset_pending");
    return true;
}

bool checkBusinessPost(const char* context, bool allowFactoryResetPending = false) {
    if (!Esp32BaseWeb::checkPostAllowed(context)) {
        return false;
    }
    if (!allowFactoryResetPending && rejectFactoryResetPending()) {
        return false;
    }
    return true;
}

bool readU32(const char* name, uint32_t* value) {
    char text[24] = "";
    if (!value || !Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return false;
    }
    char* end = nullptr;
    const unsigned long parsed = strtoul(text, &end, 10);
    if (!end || *end != '\0') {
        return false;
    }
    *value = static_cast<uint32_t>(parsed);
    return true;
}

bool readU16(const char* name, uint16_t* value) {
    uint32_t raw = 0;
    if (!value || !readU32(name, &raw) || raw > 65535UL) {
        return false;
    }
    *value = static_cast<uint16_t>(raw);
    return true;
}

bool readU8(const char* name, uint8_t* value) {
    uint32_t raw = 0;
    if (!value || !readU32(name, &raw) || raw > 255UL) {
        return false;
    }
    *value = static_cast<uint8_t>(raw);
    return true;
}

bool readI16(const char* name, int16_t* value) {
    char text[16] = "";
    if (!value || !Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return false;
    }
    char* end = nullptr;
    const long parsed = strtol(text, &end, 10);
    if (!end || *end != '\0' || parsed < -32768L || parsed > 32767L) {
        return false;
    }
    *value = static_cast<int16_t>(parsed);
    return true;
}

bool readTextParam(const char* name, char* out, size_t outLen) {
    char text[96] = "";
    if (!out || outLen == 0 || !Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return false;
    }
    const size_t len = strlen(text);
    if (len == 0 || len >= outLen) {
        return false;
    }
    strlcpy(out, text, outLen);
    return true;
}

bool readBool(const char* name, bool* value) {
    char text[8] = "";
    if (!value || !Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return false;
    }
    if (strcmp(text, "1") == 0 || strcmp(text, "true") == 0 || strcmp(text, "on") == 0) {
        *value = true;
        return true;
    }
    if (strcmp(text, "0") == 0 || strcmp(text, "false") == 0) {
        *value = false;
        return true;
    }
    return false;
}

bool readCheckbox(const char* name) {
    bool value = false;
    return Esp32BaseWeb::hasParam(name) && readBool(name, &value) && value;
}

bool readZoneId(uint8_t* zoneId) {
    return readU8("zoneId", zoneId) && Irrigation::validZoneId(*zoneId);
}

bool readOptionalZoneId(uint8_t* zoneId) {
    if (!zoneId || !Esp32BaseWeb::hasParam("zoneId")) {
        return false;
    }
    uint8_t parsed = 0;
    if (!readZoneId(&parsed)) {
        return false;
    }
    *zoneId = parsed;
    return true;
}

const char* zoneErrorLabel(Irrigation::ZoneErrorCode code);
const char* zoneErrorClearConfirm(Irrigation::ZoneErrorCode code);
const char* zoneStateLabel(Irrigation::ZoneState state);
const char* taskTypeLabel(Irrigation::TaskType type);
const char* taskResultLabel(Irrigation::TaskResult result);

bool readYmd(const char* name, uint32_t* ymd) {
    char text[16] = "";
    if (!ymd || !Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return false;
    }
    if (strlen(text) == 10 && text[4] == '-' && text[7] == '-') {
        for (uint8_t i = 0; i < 10; ++i) {
            if ((i == 4 || i == 7) ? text[i] != '-' : (text[i] < '0' || text[i] > '9')) {
                return false;
            }
        }
        const uint32_t parsed = static_cast<uint32_t>((text[0] - '0') * 1000 + (text[1] - '0') * 100 + (text[2] - '0') * 10 + (text[3] - '0')) * 10000UL +
                                static_cast<uint32_t>((text[5] - '0') * 10 + (text[6] - '0')) * 100UL +
                                static_cast<uint32_t>((text[8] - '0') * 10 + (text[9] - '0'));
        if (!PlanStore::validYmd(parsed)) {
            return false;
        }
        *ymd = parsed;
        return true;
    }
    return readU32(name, ymd) && PlanStore::validYmd(*ymd);
}

