tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
bool readTimeParam(const char* name, uint8_t* hour, uint8_t* minute) {
    char text[8] = "";
    if (!hour || !minute || !Esp32BaseWeb::getParam(name, text, sizeof(text)) || strlen(text) != 5 || text[2] != ':') {
        return false;
    }
    if (text[0] < '0' || text[0] > '9' || text[1] < '0' || text[1] > '9' ||
        text[3] < '0' || text[3] > '9' || text[4] < '0' || text[4] > '9') {
        return false;
    }
    const uint8_t h = static_cast<uint8_t>((text[0] - '0') * 10 + (text[1] - '0'));
    const uint8_t m = static_cast<uint8_t>((text[3] - '0') * 10 + (text[4] - '0'));
    if (h > 23 || m > 59) {
        return false;
    }
    *hour = h;
    *minute = m;
    return true;
}

Irrigation::StartSource startSourceFromRequest() {
    char source[16] = "";
    return Esp32BaseWeb::getParam("source", source, sizeof(source)) && strcmp(source, "web_page") == 0
        ? Irrigation::StartSource::WEB_PAGE
        : Irrigation::StartSource::HTTP_API;
}

Irrigation::StopSource stopSourceFromRequest() {
    char source[16] = "";
    return Esp32BaseWeb::getParam("source", source, sizeof(source)) && strcmp(source, "web_page") == 0
        ? Irrigation::StopSource::WEB_PAGE
        : Irrigation::StopSource::HTTP_API;
}

bool wantsRedirect() {
    char source[16] = "";
    return Esp32BaseWeb::getParam("source", source, sizeof(source)) && strcmp(source, "web_page") == 0;
}

void redirectOrOk(const char* path = "/index") {
    if (wantsRedirect() && !Esp32BaseWeb::isAjaxRequest()) {
        Esp32BaseWeb::redirectSeeOther(path);
        return;
    }
    sendOk();
}

uint32_t currentYmd() {
    uint32_t ymd = 0;
    return PlanStore::currentYmd(&ymd) ? ymd : 0;
}

void writeDuration(uint32_t seconds) {
    writeUInt(seconds / 60UL);
    Esp32BaseWeb::sendChunk(" 分钟");
}

void writeTime(uint8_t hour, uint8_t minute) {
    char text[8];
    snprintf(text, sizeof(text), "%02u:%02u", static_cast<unsigned>(hour), static_cast<unsigned>(minute));
    Esp32BaseWeb::sendChunk(text);
}

void writeYmdInput(uint32_t ymd) {
    if (!PlanStore::validYmd(ymd)) {
        return;
    }
    char text[12];
    snprintf(text, sizeof(text), "%04lu-%02lu-%02lu",
             static_cast<unsigned long>(ymd / 10000UL),
             static_cast<unsigned long>((ymd / 100UL) % 100UL),
             static_cast<unsigned long>(ymd % 100UL));
    Esp32BaseWeb::sendChunk(text);
}

const char* uiToneForState(Irrigation::ZoneState state) {
    switch (state) {
        case Irrigation::ZoneState::RUNNING:
        case Irrigation::ZoneState::STARTING: return " warn";
        case Irrigation::ZoneState::ERROR: return " danger";
        case Irrigation::ZoneState::IDLE: return " ok";
        case Irrigation::ZoneState::DISABLED:
        default: return "";
    }
}

void writeStatusJson(const Irrigation::ZoneStatus& status) {
    Esp32BaseWeb::sendChunk("{\"zoneId\":");
    writeUInt(status.zoneId);
    Esp32BaseWeb::sendChunk(",\"state\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::zoneStateName(status.state));
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    writeBool(status.enabled);
    Esp32BaseWeb::sendChunk(",\"busy\":");
    writeBool(status.busy);
    Esp32BaseWeb::sendChunk(",\"errorActive\":");
    writeBool(status.errorActive);
    Esp32BaseWeb::sendChunk(",\"errorCode\":\"");
    Esp32BaseWeb::writeJsonEscaped(zoneErrorLabel(status.errorCode));
    Esp32BaseWeb::sendChunk("\"");
    Esp32BaseWeb::sendChunk(",\"taskType\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::taskTypeName(status.taskType));
    Esp32BaseWeb::sendChunk("\",\"taskLabel\":\"");
    Esp32BaseWeb::writeJsonEscaped(status.busy ? taskTypeLabel(status.taskType) : "-");
    Esp32BaseWeb::sendChunk("\"");
    Esp32BaseWeb::sendChunk(",\"targetSec\":");
    writeUInt(status.targetSec);
    Esp32BaseWeb::sendChunk(",\"elapsedSec\":");
    writeUInt(status.elapsedSec);
    Esp32BaseWeb::sendChunk(",\"remainingSec\":");
    writeUInt(status.remainingSec);
    Esp32BaseWeb::sendChunk(",\"pulses\":");
    writeUInt(status.pulses);
    Esp32BaseWeb::sendChunk(",\"estimatedMl\":");
    writeUInt(status.estimatedMilliliters);
    Esp32BaseWeb::sendChunk(",\"flowRatePerMinuteX1000\":");
    writeUInt(status.flowRatePerMinuteX1000);
    Esp32BaseWeb::sendChunk(",\"flowMlPerMin\":");
    writeUInt(status.flowMlPerMin);
    Esp32BaseWeb::sendChunk(",\"flowRateReady\":");
    writeBool(status.flowRateReady);
    Esp32BaseWeb::sendChunk(",\"planId\":");
    writeUInt(status.planId);
    Esp32BaseWeb::sendChunk("}");
}

void writePlanJson(const Irrigation::PlanDefinition& plan) {
    Esp32BaseWeb::sendChunk("{\"exists\":");
    writeBool(plan.exists);
    Esp32BaseWeb::sendChunk(",\"planId\":");
    writeUInt(plan.planId);
    Esp32BaseWeb::sendChunk(",\"zoneId\":");
    writeUInt(plan.zoneId);
    Esp32BaseWeb::sendChunk(",\"slotIndex\":");
    writeUInt(plan.slotIndex);
    Esp32BaseWeb::sendChunk(",\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(plan.name);
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    writeBool(plan.enabled);
    Esp32BaseWeb::sendChunk(",\"time\":\"");
    writeTime(plan.timeHour, plan.timeMinute);
    Esp32BaseWeb::sendChunk("\",\"durationSec\":");
    writeUInt(plan.durationSec);
    Esp32BaseWeb::sendChunk(",\"cycleDays\":");
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk(",\"cycleMask\":");
    writeUInt(plan.cycleMask);
    Esp32BaseWeb::sendChunk(",\"cycleStartYmd\":");
    writeUInt(plan.cycleStartYmd);
    Esp32BaseWeb::sendChunk("}");
}

void writeOnePostHidden(const char* name, const char* value) {
    Esp32BaseWeb::sendChunk("<input type='hidden' name='");
    Esp32BaseWeb::writeHtmlEscaped(name);
    Esp32BaseWeb::sendChunk("' value='");
    Esp32BaseWeb::writeHtmlEscaped(value);
    Esp32BaseWeb::sendChunk("'>");
}

void writeHiddenU32(const char* name, uint32_t value) {
    char text[16];
    snprintf(text, sizeof(text), "%lu", static_cast<unsigned long>(value));
    writeOnePostHidden(name, text);
}

