tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void pageHeader(const char* title) {
    Esp32BaseWeb::sendHeader(title);
}

void pageFooter() {
    Esp32BaseWeb::sendFooter();
}

uint32_t durationMinutesForUi(uint32_t seconds) {
    return seconds == 0 ? 0 : ((seconds + 59UL) / 60UL);
}

void writeDurationMinutes(uint32_t seconds) {
    writeUInt(durationMinutesForUi(seconds));
    Esp32BaseWeb::sendChunk(" 分钟");
}

void writeCycleSummary(const Irrigation::PlanDefinition& plan) {
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk(" 天循环：");
    bool first = true;
    for (uint8_t i = 0; i < plan.cycleDays; ++i) {
        if ((plan.cycleMask & (1UL << i)) == 0) {
            continue;
        }
        if (!first) {
            Esp32BaseWeb::sendChunk("、");
        }
        first = false;
        Esp32BaseWeb::sendChunk("第 ");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk(" 天");
    }
}

void formatDurationHuman(uint32_t seconds, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    const uint32_t hours = seconds / 3600UL;
    const uint32_t minutes = (seconds % 3600UL) / 60UL;
    const uint32_t secs = seconds % 60UL;
    size_t used = 0;
    out[0] = '\0';
    if (hours > 0) {
        used += snprintf(out + used, len - used, "%lu小时", static_cast<unsigned long>(hours));
    }
    if (used < len && minutes > 0) {
        used += snprintf(out + used, len - used, "%lu分钟", static_cast<unsigned long>(minutes));
    }
    if (used < len && (secs > 0 || used == 0)) {
        (void)snprintf(out + used, len - used, "%lu秒", static_cast<unsigned long>(secs));
    }
}

void writeDurationHuman(uint32_t seconds) {
    char text[32];
    formatDurationHuman(seconds, text, sizeof(text));
    Esp32BaseWeb::sendChunk(text);
}

void writeDurationMsHuman(uint32_t ms) {
    writeDurationHuman((ms + 999UL) / 1000UL);
}

void writeDurationMsHumanCompact(uint32_t ms) {
    writeDurationHuman((ms + 999UL) / 1000UL);
}

void writeLitersFromMilliliters(uint32_t milliliters) {
    char text[24];
    snprintf(text, sizeof(text), "%lu.%03lu L",
             static_cast<unsigned long>(milliliters / 1000UL),
             static_cast<unsigned long>(milliliters % 1000UL));
    Esp32BaseWeb::sendChunk(text);
}

void writeFlowRate(uint32_t mlPerMin) {
    char text[28];
    snprintf(text, sizeof(text), "%lu.%03lu L/min",
             static_cast<unsigned long>(mlPerMin / 1000UL),
             static_cast<unsigned long>(mlPerMin % 1000UL));
    Esp32BaseWeb::sendChunk(text);
}

uint32_t estimateMlFromFlowPulses(uint32_t pulses, const Irrigation::FlowParameters& flow) {
    if (flow.stablePulsePerLiter == 0) {
        return 0;
    }
    if (flow.startupPulseLimit == 0) {
        return static_cast<uint32_t>((static_cast<uint64_t>(pulses) * 1000ULL) / flow.stablePulsePerLiter);
    }
    const uint32_t startupPulses = pulses < flow.startupPulseLimit ? pulses : flow.startupPulseLimit;
    const uint32_t stablePulses = pulses > flow.startupPulseLimit ? pulses - flow.startupPulseLimit : 0;
    const uint64_t startupMl = (static_cast<uint64_t>(startupPulses) * flow.startupEstimatedMl) / flow.startupPulseLimit;
    const uint64_t stableMl = (static_cast<uint64_t>(stablePulses) * 1000ULL) / flow.stablePulsePerLiter;
    return static_cast<uint32_t>(startupMl + stableMl);
}

uint32_t averageFlowMlPerMin(const RecordStore::WateringRecord& record) {
    if (record.endedUptimeMs <= record.startedUptimeMs) {
        return 0;
    }
    const uint32_t durationMs = record.endedUptimeMs - record.startedUptimeMs;
    return static_cast<uint32_t>((static_cast<uint64_t>(record.estimatedMilliliters) * 60000ULL) / durationMs);
}

void writeAverageFlowRate(const RecordStore::WateringRecord& record) {
    if (record.endedUptimeMs <= record.startedUptimeMs) {
        Esp32BaseWeb::sendChunk("-");
        return;
    }
    writeFlowRate(averageFlowMlPerMin(record));
}

void writeRecordFlowAt(uint32_t elapsedSec) {
    char text[16];
    snprintf(text, sizeof(text), "%02lu:%02lu",
             static_cast<unsigned long>(elapsedSec / 60UL),
             static_cast<unsigned long>(elapsedSec % 60UL));
    Esp32BaseWeb::sendChunk(text);
}

void writeRecordPeakFlow(uint32_t mlPerMin, uint32_t firstAtSec, bool valid) {
    if (!valid) {
        Esp32BaseWeb::sendChunk("-");
        return;
    }
    writeFlowRate(mlPerMin);
    Esp32BaseWeb::sendChunk(" @ ");
    writeRecordFlowAt(firstAtSec);
}

const char* calibrationStateLabel(FlowCalibration::State state) {
    switch (state) {
        case FlowCalibration::State::CAPTURING: return "采集中";
        case FlowCalibration::State::WAITING_ACTUAL: return "等待输入水量";
        case FlowCalibration::State::IDLE:
        default: return "空闲";
    }
}

const char* calibrationStateName(FlowCalibration::State state) {
    switch (state) {
        case FlowCalibration::State::CAPTURING: return "capturing";
        case FlowCalibration::State::WAITING_ACTUAL: return "waiting_actual";
        case FlowCalibration::State::IDLE:
        default: return "idle";
    }
}

static constexpr uint32_t calibrationWindowMs = 2000UL;
static constexpr uint32_t calibrationWindowStepMs = 200UL;

void writePermilleAsPercent(uint16_t permille) {
    writeUInt(permille / 10U);
    Esp32BaseWeb::sendChunk(".");
    writeUInt(permille % 10U);
    Esp32BaseWeb::sendChunk("%");
}

const char* calibrationRecommendationAdvice(const FlowCalibration::Recommendation& rec) {
    if (rec.sampleCount <= 1) {
        return "单条样本只能生成单点估计，无法交叉验证误差；建议补采不同水量样本。";
    }
    if (rec.sampleCount == 2) {
        if (rec.volumeSpanPermille < 200 || rec.pulseSpanPermille < 200) {
            return "两条样本水量或脉冲跨度偏小，建议补采一条明显不同水量的样本。";
        }
        if (rec.averageErrorPermille <= 50 && rec.maxErrorPermille <= 80) {
            return "两条样本拟合误差较小，可试用；建议补采一条不同水量样本做验证。";
        }
        return "两条样本拟合误差偏大，建议重采或检查接水量、流量稳定性。";
    }
    if (rec.averageErrorPermille <= 50 && rec.maxErrorPermille <= 80) {
        return "样本内误差较小，建议可应用。";
    }
    if (rec.averageErrorPermille <= 100 && rec.maxErrorPermille <= 150) {
        return "样本内误差可接受，可应用但建议复核。";
    }
    return "样本误差偏大，不建议应用；建议重采或检查接水量、流量稳定性。";
}

