tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
bool readFlowParameters(Irrigation::FlowParameters* out) {
    if (!out) {
        return false;
    }
    Irrigation::FlowParameters params = {};
    if (!readU16("startupPulseLimit", &params.startupPulseLimit) ||
        !readU16("startupEstimatedMl", &params.startupEstimatedMl) ||
        !readU16("stablePulsePerLiter", &params.stablePulsePerLiter)) {
        return false;
    }
    params = ZoneConfigStore::normalizeFlowParameters(params);
    if (!ZoneConfigStore::validateFlowParameters(params)) {
        return false;
    }
    *out = params;
    return true;
}

void writeFlowParameterLineStyle() {
    Esp32BaseWeb::sendChunk("<style>"
                            ".calibration-param-line{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:6px 10px;align-items:baseline}"
                            ".calibration-param-line .param{display:flex;gap:5px;align-items:baseline;min-width:0;color:var(--eb-muted);font-size:13px;white-space:normal}"
                            ".calibration-param-line .value{color:var(--eb-ink);font-weight:500}"
                            ".calibration-param-compact{color:var(--eb-muted);font-size:13px;line-height:1.45;overflow-wrap:anywhere}"
                            ".calibration-param-compact .value{color:var(--eb-ink);font-weight:600}"
                            "@media(max-width:720px){.calibration-param-line{grid-template-columns:1fr}}"
                            "</style>");
}

void writeFlowParameterLine(const Irrigation::FlowParameters& params) {
    Esp32BaseWeb::sendChunk("<div class='calibration-param-line'><span class='param'><span>启动脉冲</span><span class='value'>");
    writeUInt(params.startupPulseLimit);
    Esp32BaseWeb::sendChunk("</span></span><span class='param'><span>启动水量</span><span class='value'>");
    writeUInt(params.startupEstimatedMl);
    Esp32BaseWeb::sendChunk(" ml</span></span><span class='param'><span>稳定脉冲</span><span class='value'>");
    writeUInt(params.stablePulsePerLiter);
    Esp32BaseWeb::sendChunk(" P/L</span></span></div>");
}

void writeFlowParameterCompact(const Irrigation::FlowParameters& params) {
    Esp32BaseWeb::sendChunk("<p class='calibration-param-compact'>启动 <span class='value'>");
    writeUInt(params.startupPulseLimit);
    Esp32BaseWeb::sendChunk("P</span> · <span class='value'>");
    writeUInt(params.startupEstimatedMl);
    Esp32BaseWeb::sendChunk(" ml</span> · 稳定 <span class='value'>");
    writeUInt(params.stablePulsePerLiter);
    Esp32BaseWeb::sendChunk(" P/L</span></p>");
}

void writeFlowParametersJson(const Irrigation::FlowParameters& params) {
    Esp32BaseWeb::sendChunk("{\"startupPulseLimit\":");
    writeUInt(params.startupPulseLimit);
    Esp32BaseWeb::sendChunk(",\"startupEstimatedMl\":");
    writeUInt(params.startupEstimatedMl);
    Esp32BaseWeb::sendChunk(",\"stablePulsePerLiter\":");
    writeUInt(params.stablePulsePerLiter);
    Esp32BaseWeb::sendChunk("}");
}

void writeFlowParameterInputs(const Irrigation::FlowParameters& params) {
    Esp32BaseWeb::sendChunk("<p class='field short'><label>启动阶段脉冲</label><input name='startupPulseLimit' type='number' min='0' max='10000' value='");
    writeUInt(params.startupPulseLimit);
    Esp32BaseWeb::sendChunk("' required></p><p class='field short'><label>启动阶段水量 ml</label><input name='startupEstimatedMl' type='number' min='0' max='10000' value='");
    writeUInt(params.startupEstimatedMl);
    Esp32BaseWeb::sendChunk("' required></p><p class='field short'><label>稳定脉冲 P/L</label><input name='stablePulsePerLiter' type='number' min='1' max='10000' value='");
    writeUInt(params.stablePulsePerLiter);
    Esp32BaseWeb::sendChunk("' required></p>");
}

void writeFlowParameterLifecyclePanel() {
    Esp32BaseWeb::beginPanel("流量参数");
    Esp32BaseWeb::sendChunk("<div id='calibrationParamPanel'><div class='calibration-zone-list'>");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& zone = ZoneManager::config(zoneId);
        const bool busy = ZoneManager::isZoneBusy(zoneId);
        const bool candidateMatches = zone.candidateFlow.exists && ZoneConfigStore::flowParametersEqual(zone.flow, zone.candidateFlow.params);
        Esp32BaseWeb::sendChunk("<section class='calibration-zone-row'><div class='calibration-zone-head'><div><h3>");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</h3><span class='tag");
        Esp32BaseWeb::sendChunk(zone.enabled ? " ok" : "");
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::sendChunk(zone.enabled ? "启用" : "停用");
        Esp32BaseWeb::sendChunk("</span>");
        if (busy) {
            Esp32BaseWeb::sendChunk(" <span class='tag warn'>运行中</span>");
        }
        Esp32BaseWeb::sendChunk("</div></div><div class='calibration-param-grid'>");

        Esp32BaseWeb::sendChunk("<div class='calibration-param-card current'><div class='calibration-param-head'><h4>当前参数</h4><span class='tag ok'>正在使用</span></div>");
        writeFlowParameterCompact(zone.flow);
        Esp32BaseWeb::sendChunk("</div>");

        Esp32BaseWeb::sendChunk("<div class='calibration-param-card candidate'><div class='calibration-param-head'><h4>候选参数</h4>");
        if (zone.candidateFlow.exists && !candidateMatches) {
            Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/calibration/apply' onsubmit=\"return confirm('确认将候选参数设为当前参数？当前参数会保存为上一套。')&&once(this)&&calibrationSubmit(this)\">");
            writeOnePostHidden("source", "web_page");
            writeHiddenU32("zoneId", zoneId);
            Esp32BaseWeb::sendChunk("<input class='btnlink compact ok'");
            if (busy) {
                Esp32BaseWeb::sendChunk(" disabled");
            }
            Esp32BaseWeb::sendChunk(" type='submit' value='设为当前'></form>");
        } else if (zone.candidateFlow.exists) {
            Esp32BaseWeb::sendChunk("<span class='tag'>与当前一致</span>");
        }
        Esp32BaseWeb::sendChunk("<button type='button' class='btnlink compact secondary' onclick='calibrationCandidateOpen(");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk(")'>");
        Esp32BaseWeb::sendChunk(zone.candidateFlow.exists ? "编辑候选" : "创建候选");
        Esp32BaseWeb::sendChunk("</button>");
        Esp32BaseWeb::sendChunk("</div>");
        if (zone.candidateFlow.exists) {
            writeFlowParameterCompact(zone.candidateFlow.params);
            Esp32BaseWeb::sendChunk("<p class='calibration-param-note'>");
            Esp32BaseWeb::sendChunk(candidateMatches ? "候选参数与当前参数一致。" : "候选参数已保存，尚未设为当前。");
            Esp32BaseWeb::sendChunk("</p>");
        } else {
            Esp32BaseWeb::sendChunk("<p class='calibration-param-note'>暂无候选参数。</p>");
        }
        Esp32BaseWeb::sendChunk("</div>");

