tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
        Esp32BaseWeb::sendChunk("<div class='calibration-param-card previous'><div class='calibration-param-head'><h4>上一套参数</h4>");
        if (zone.previousFlowExists && !ZoneConfigStore::flowParametersEqual(zone.flow, zone.previousFlow)) {
            Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/calibration/previous/restore' onsubmit=\"return confirm('确认将上一套参数设为当前参数？当前参数会与上一套互换。')&&once(this)&&calibrationSubmit(this)\">");
            writeOnePostHidden("source", "web_page");
            writeHiddenU32("zoneId", zoneId);
            Esp32BaseWeb::sendChunk("<input class='btnlink compact secondary'");
            if (busy) {
                Esp32BaseWeb::sendChunk(" disabled");
            }
            Esp32BaseWeb::sendChunk(" type='submit' value='设为当前'></form>");
        }
        Esp32BaseWeb::sendChunk("</div>");
        if (zone.previousFlowExists) {
            writeFlowParameterCompact(zone.previousFlow);
            if (ZoneConfigStore::flowParametersEqual(zone.flow, zone.previousFlow)) {
                Esp32BaseWeb::sendChunk("<p class='calibration-param-note'>上一套参数与当前参数一致。</p>");
            }
        } else {
            Esp32BaseWeb::sendChunk("<p class='calibration-param-note'>暂无上一套参数。</p>");
        }
        Esp32BaseWeb::sendChunk("</div></div></section>");

        const Irrigation::FlowParameters formParams = zone.candidateFlow.exists ? zone.candidateFlow.params : zone.flow;
        Esp32BaseWeb::sendChunk("<dialog id='calibrationCandidateDialog");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("' class='calibration-dialog calibration-candidate-dialog'><form class='editform' method='post' action='/api/v1/calibration/candidate' onsubmit=\"return confirm('确认保存候选参数？')&&once(this)&&calibrationSubmit(this)\">");
        writeOnePostHidden("source", "web_page");
        writeHiddenU32("zoneId", zoneId);
        Esp32BaseWeb::sendChunk("<h3>");
        Esp32BaseWeb::sendChunk(zone.candidateFlow.exists ? "编辑候选参数" : "创建候选参数");
        Esp32BaseWeb::sendChunk("</h3><p class='calibration-param-note'>候选参数只是待确认的参数值，不会改变当前运行估算。</p><div class='calibration-copy-fill'><label>从其他水路填入</label><div class='calibration-fill-row'><select id='calibrationFillSource");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'>");
        for (uint8_t fillZoneId = 1; fillZoneId <= Irrigation::MaxZones; ++fillZoneId) {
            if (fillZoneId == zoneId) {
                continue;
            }
            const Irrigation::FlowParameters& src = ZoneManager::config(fillZoneId).flow;
            Esp32BaseWeb::sendChunk("<option value='");
            writeUInt(fillZoneId);
            Esp32BaseWeb::sendChunk("' data-startup-pulse='");
            writeUInt(src.startupPulseLimit);
            Esp32BaseWeb::sendChunk("' data-startup-ml='");
            writeUInt(src.startupEstimatedMl);
            Esp32BaseWeb::sendChunk("' data-stable-pulse='");
            writeUInt(src.stablePulsePerLiter);
            Esp32BaseWeb::sendChunk("'>");
            Esp32BaseWeb::writeHtmlEscaped(ZoneManager::config(fillZoneId).name);
            Esp32BaseWeb::sendChunk("</option>");
        }
        Esp32BaseWeb::sendChunk("</select><button type='button' class='btnlink compact secondary' onclick='calibrationCandidateFill(");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk(")'>填入表单</button></div></div><div class='fieldgrid'>");
        writeFlowParameterInputs(formParams);
        Esp32BaseWeb::sendChunk("</div><div class='actions'><input type='submit' value='保存为候选'><button class='btnlink secondary' type='button' onclick='calibrationCandidateClose(");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk(")'>取消</button></div></form></dialog>");
    }
    Esp32BaseWeb::sendChunk("</div><p class='calibration-param-note'>当前参数正在用于运行估算；候选参数只保存最终参数值，可手工输入、从其他水路填入后保存，或由校准样本生成。设为当前前会自动保存当前参数为上一套参数。</p></div>"
                            "<script>"
                            "function calibrationCandidateDialog(id){return document.getElementById('calibrationCandidateDialog'+id);}"
                            "function calibrationCandidateOpen(id){var d=calibrationCandidateDialog(id);if(!d)return;if(d.showModal)d.showModal();else d.setAttribute('open','open');}"
                            "function calibrationCandidateClose(id){var d=calibrationCandidateDialog(id);if(d)d.close?d.close():d.removeAttribute('open');}"
                            "function calibrationCandidateFill(id){var s=document.getElementById('calibrationFillSource'+id),d=calibrationCandidateDialog(id);if(!s||!d||!s.selectedOptions.length)return;var o=s.selectedOptions[0];d.querySelector('[name=startupPulseLimit]').value=o.dataset.startupPulse||0;d.querySelector('[name=startupEstimatedMl]').value=o.dataset.startupMl||0;d.querySelector('[name=stablePulsePerLiter]').value=o.dataset.stablePulse||450;}"
                            "</script>");
    Esp32BaseWeb::endPanel();
}

void writeSvgPoint(uint32_t x, uint32_t y) {
    char text[32];
    snprintf(text, sizeof(text), "%lu,%lu ", static_cast<unsigned long>(x), static_cast<unsigned long>(y));
    Esp32BaseWeb::sendChunk(text);
}

void writeChartTimeLabel(uint32_t ms) {
    if (ms < 10000UL && (ms % 1000UL) != 0) {
        writeUInt(ms / 1000UL);
        Esp32BaseWeb::sendChunk(".");
        writeUInt((ms % 1000UL) / 100UL);
        Esp32BaseWeb::sendChunk("秒");
        return;
    }
    writeUInt((ms + 500UL) / 1000UL);
    Esp32BaseWeb::sendChunk("秒");
}

void writeChartAxisTitle(const char* xTitle,
                         const char* yTitle,
                         uint32_t left,
                         uint32_t top,
                         uint32_t width,
                         uint32_t height,
                         uint32_t svgHeight) {
    Esp32BaseWeb::sendChunk("<text class='chart-axis-title' x='");
    writeUInt(left + width / 2UL);
    Esp32BaseWeb::sendChunk("' y='");
    writeUInt(svgHeight - 10UL);
    Esp32BaseWeb::sendChunk("' text-anchor='middle'>");
    Esp32BaseWeb::writeHtmlEscaped(xTitle);
    Esp32BaseWeb::sendChunk("</text><text class='chart-axis-title' x='");
    writeUInt(14);
    Esp32BaseWeb::sendChunk("' y='");
    writeUInt(top + height / 2UL);
    Esp32BaseWeb::sendChunk("' text-anchor='middle' transform='rotate(-90 14 ");
    writeUInt(top + height / 2UL);
    Esp32BaseWeb::sendChunk(")'>");
    Esp32BaseWeb::writeHtmlEscaped(yTitle);
    Esp32BaseWeb::sendChunk("</text>");
}

void writeChartTicks(uint32_t durationMs,
                     uint32_t maxValue,
                     uint32_t left,
                     uint32_t top,
                     uint32_t width,
                     uint32_t height) {
    static constexpr uint8_t xSegments = 6;
    static constexpr uint8_t ySegments = 5;
    for (uint8_t i = 0; i <= xSegments; ++i) {
        const uint32_t x = left + static_cast<uint32_t>((static_cast<uint64_t>(width) * i) / xSegments);
        const uint32_t labelMs = static_cast<uint32_t>((static_cast<uint64_t>(durationMs) * i) / xSegments);
        Esp32BaseWeb::sendChunk("<line class='chart-grid' x1='");
        writeUInt(x);
        Esp32BaseWeb::sendChunk("' y1='");
        writeUInt(top);
        Esp32BaseWeb::sendChunk("' x2='");
        writeUInt(x);
        Esp32BaseWeb::sendChunk("' y2='");
        writeUInt(top + height);
        Esp32BaseWeb::sendChunk("'></line><text class='chart-tick' x='");
        writeUInt(x);
        Esp32BaseWeb::sendChunk("' y='");
        writeUInt(top + height + 18UL);
        Esp32BaseWeb::sendChunk("' text-anchor='middle'>");
        writeChartTimeLabel(labelMs);
        Esp32BaseWeb::sendChunk("</text>");
    }
    for (uint8_t i = 0; i <= ySegments; ++i) {
        const uint32_t y = top + height - static_cast<uint32_t>((static_cast<uint64_t>(height) * i) / ySegments);
        const uint32_t value = static_cast<uint32_t>((static_cast<uint64_t>(maxValue) * i) / ySegments);
        Esp32BaseWeb::sendChunk("<line class='chart-grid' x1='");
        writeUInt(left);
        Esp32BaseWeb::sendChunk("' y1='");
        writeUInt(y);
        Esp32BaseWeb::sendChunk("' x2='");
        writeUInt(left + width);
        Esp32BaseWeb::sendChunk("' y2='");
        writeUInt(y);
        Esp32BaseWeb::sendChunk("'></line><text class='chart-tick' x='");
        writeUInt(left - 10UL);
        Esp32BaseWeb::sendChunk("' y='");
        writeUInt(y + 4UL);
        Esp32BaseWeb::sendChunk("' text-anchor='end'>");
        writeUInt(value);
        Esp32BaseWeb::sendChunk("</text>");
    }
}

void writeStableMarker(uint32_t stableStartMs, uint32_t durationMs, uint32_t left, uint32_t top, uint32_t width, uint32_t height) {
    if (stableStartMs == 0 || durationMs == 0 || stableStartMs > durationMs) {
        return;
    }
    const uint32_t x = left + static_cast<uint32_t>((static_cast<uint64_t>(stableStartMs) * width) / durationMs);
    Esp32BaseWeb::sendChunk("<rect x='");
    writeUInt(left);
    Esp32BaseWeb::sendChunk("' y='");
    writeUInt(top);
    Esp32BaseWeb::sendChunk("' width='");
    writeUInt(x > left ? x - left : 0);
    Esp32BaseWeb::sendChunk("' height='");
    writeUInt(height);
    Esp32BaseWeb::sendChunk("' class='chart-startup'></rect><line x1='");
    writeUInt(x);
    Esp32BaseWeb::sendChunk("' y1='");
    writeUInt(top);
    Esp32BaseWeb::sendChunk("' x2='");
    writeUInt(x);
    Esp32BaseWeb::sendChunk("' y2='");
    writeUInt(top + height);
    Esp32BaseWeb::sendChunk("' class='chart-stable-marker'></line>");
}

