tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeChartFrame(uint32_t left, uint32_t top, uint32_t width, uint32_t height) {
    Esp32BaseWeb::sendChunk("<line x1='");
    writeUInt(left);
    Esp32BaseWeb::sendChunk("' y1='");
    writeUInt(top + height);
    Esp32BaseWeb::sendChunk("' x2='");
    writeUInt(left + width);
    Esp32BaseWeb::sendChunk("' y2='");
    writeUInt(top + height);
    Esp32BaseWeb::sendChunk("' class='chart-axis'></line><line x1='");
    writeUInt(left);
    Esp32BaseWeb::sendChunk("' y1='");
    writeUInt(top);
    Esp32BaseWeb::sendChunk("' x2='");
    writeUInt(left);
    Esp32BaseWeb::sendChunk("' y2='");
    writeUInt(top + height);
    Esp32BaseWeb::sendChunk("' class='chart-axis'></line>");
}

void writeCumulativePulseChart(uint8_t sampleIndex, const FlowCalibration::Sample& sample) {
    static constexpr uint32_t left = 62;
    static constexpr uint32_t top = 22;
    static constexpr uint32_t width = 832;
    static constexpr uint32_t height = 128;
    static constexpr uint32_t svgHeight = 200;
    const uint32_t durationMs = sample.durationMs == 0 ? 1UL : sample.durationMs;
    const uint32_t maxPulse = sample.detailCapturedPulses == 0 ? 1UL : sample.detailCapturedPulses;
    Esp32BaseWeb::sendChunk("<div class='calibration-chart'><div class='calibration-chart-head'><h3>累计脉冲</h3><span>原始明细脉冲随时间累计</span></div><svg viewBox='0 0 940 200' role='img' aria-label='累计脉冲图表'>");
    writeStableMarker(sample.stableStartMs, durationMs, left, top, width, height);
    writeChartTicks(durationMs, maxPulse, left, top, width, height);
    writeChartFrame(left, top, width, height);
    Esp32BaseWeb::sendChunk("<polyline class='chart-line cumulative' fill='none' points='");
    uint32_t timeMs = 0;
    for (uint16_t i = 0; i < sample.detailCapturedPulses; ++i) {
        timeMs += FlowCalibration::samplePulseDelta(sampleIndex, i);
        if (timeMs > durationMs) {
            timeMs = durationMs;
        }
        const uint32_t x = left + static_cast<uint32_t>((static_cast<uint64_t>(timeMs) * width) / durationMs);
        const uint32_t y = top + height - static_cast<uint32_t>((static_cast<uint64_t>(i + 1UL) * height) / maxPulse);
        writeSvgPoint(x, y);
    }
    Esp32BaseWeb::sendChunk("'></polyline>");
    writeChartAxisTitle("时间 (秒)", "累计脉冲", left, top, width, height, svgHeight);
    Esp32BaseWeb::sendChunk("</svg></div>");
}

void writeWindowPulseChart(uint8_t sampleIndex, const FlowCalibration::Sample& sample) {
    static constexpr uint32_t left = 62;
    static constexpr uint32_t top = 22;
    static constexpr uint32_t width = 832;
    static constexpr uint32_t height = 128;
    static constexpr uint32_t svgHeight = 200;
    const uint32_t durationMs = sample.durationMs == 0 ? 1UL : sample.durationMs;
    uint16_t maxWindow = 1;
    for (uint16_t i = 0; i < sample.windowPulseCount; ++i) {
        const uint16_t value = FlowCalibration::sampleWindowPulse(sampleIndex, i);
        if (value > maxWindow) {
            maxWindow = value;
        }
    }
    Esp32BaseWeb::sendChunk("<div class='calibration-chart'><div class='calibration-chart-head'><h3>2 秒滑动窗口脉冲</h3><span>窗口 ");
    writeUInt(calibrationWindowMs / 1000UL);
    Esp32BaseWeb::sendChunk(" 秒 / 步进 ");
    writeUInt(calibrationWindowStepMs);
    Esp32BaseWeb::sendChunk(" ms</span></div><svg viewBox='0 0 940 200' role='img' aria-label='滑动窗口脉冲图表'>");
    writeStableMarker(sample.stableStartMs, durationMs, left, top, width, height);
    writeChartTicks(durationMs, maxWindow, left, top, width, height);
    writeChartFrame(left, top, width, height);
    Esp32BaseWeb::sendChunk("<polyline class='chart-line window' fill='none' points='");
    for (uint16_t i = 0; i < sample.windowPulseCount; ++i) {
        uint32_t timeMs = static_cast<uint32_t>(i + 1UL) * calibrationWindowStepMs;
        if (timeMs > durationMs) {
            timeMs = durationMs;
        }
        const uint16_t value = FlowCalibration::sampleWindowPulse(sampleIndex, i);
        const uint32_t x = left + static_cast<uint32_t>((static_cast<uint64_t>(timeMs) * width) / durationMs);
        const uint32_t y = top + height - static_cast<uint32_t>((static_cast<uint64_t>(value) * height) / maxWindow);
        writeSvgPoint(x, y);
    }
    Esp32BaseWeb::sendChunk("'></polyline>");
    writeChartAxisTitle("时间 (秒)", "窗口脉冲", left, top, width, height, svgHeight);
    Esp32BaseWeb::sendChunk("</svg></div>");
}

uint8_t countPlansForDate(uint32_t ymd) {
    uint8_t count = 0;
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& zone = ZoneManager::config(zoneId);
        if (!zone.enabled) {
            continue;
        }
        for (uint8_t slot = 0; slot < Irrigation::MaxPlansPerZone; ++slot) {
            const Irrigation::PlanDefinition& plan = PlanStore::getBySlot(zoneId, slot);
            if (plan.exists && plan.enabled && PlanStore::shouldRunOnDate(plan, ymd)) {
                ++count;
            }
        }
    }
    return count;
}

struct TodayPlanDisplay {
    bool exists;
    Irrigation::PlanDefinition plan;
    Irrigation::PlanObservationStatus observation;
    bool running;
    bool completed;
    uint32_t completedSec;
    Irrigation::TaskResult lastResult;
};

struct TodayPlanSummary {
    uint8_t total;
    uint8_t completed;
    uint32_t totalSec;
    uint32_t completedSec;
};

struct TodayPlanCompletion {
    uint32_t planId;
    uint32_t completedSec;
    Irrigation::TaskResult result;
};

bool todayPlanResultCompleted(Irrigation::TaskResult result) {
    return result == Irrigation::TaskResult::COMPLETED;
}

uint16_t planMinuteOfDay(const Irrigation::PlanDefinition& plan) {
    return static_cast<uint16_t>(static_cast<uint16_t>(plan.timeHour) * 60U + plan.timeMinute);
}

uint32_t ymdFromEpoch(uint32_t epoch) {
    if (epoch == 0) {
        return 0;
    }
    const time_t value = static_cast<time_t>(epoch);
    tm local = {};
    if (localtime_r(&value, &local) == nullptr) {
        return 0;
    }
    return static_cast<uint32_t>((local.tm_year + 1900) * 10000UL +
                                 (local.tm_mon + 1) * 100UL +
                                 local.tm_mday);
}

uint32_t recordRuntimeSec(const RecordStore::WateringRecord& record) {
    if (record.endedUptimeMs > record.startedUptimeMs) {
        return (record.endedUptimeMs - record.startedUptimeMs + 999UL) / 1000UL;
    }
    if (record.endedEpoch > record.startedEpoch) {
        return record.endedEpoch - record.startedEpoch;
    }
    return 0;
}

Irrigation::PlanObservationStatus planObservationFor(uint8_t zoneId,
                                                     const Irrigation::PlanDefinition& plan,
                                                     uint32_t ymd) {
    PlanExecutionTracker tracker;
    tracker.begin(zoneId);
    Irrigation::PlanObservationStatus status = Irrigation::PlanObservationStatus::NOT_EVALUATED;
    if (tracker.status(plan.planId, ymd, planMinuteOfDay(plan), &status)) {
        return status;
    }
    return Irrigation::PlanObservationStatus::NOT_EVALUATED;
}

struct TodayRecordCollectContext {
    uint8_t zoneId;
    uint32_t ymd;
    TodayPlanCompletion* out;
    uint8_t capacity;
    uint8_t count;
};

int8_t findCompletionIndex(const TodayPlanCompletion* completions, uint8_t count, uint32_t planId) {
    if (!completions || planId == Irrigation::NoPlanId) {
        return -1;
    }
    for (uint8_t i = 0; i < count; ++i) {
        if (completions[i].planId == planId) {
            return static_cast<int8_t>(i);
        }
    }
    return -1;
}

void collectTodayPlanRecord(const RecordStore::WateringRecord& record, void* user) {
    TodayRecordCollectContext* ctx = static_cast<TodayRecordCollectContext*>(user);
    if (!ctx || !ctx->out || ctx->capacity == 0) {
        return;
    }
    if (record.zoneId != ctx->zoneId ||
        record.planId == Irrigation::NoPlanId ||
        record.taskType != static_cast<uint8_t>(Irrigation::TaskType::PLAN)) {
        return;
    }
    const uint32_t endedYmd = ymdFromEpoch(record.endedEpoch);
    if (endedYmd != ctx->ymd) {
        return;
    }
    const uint32_t runtimeSec = recordRuntimeSec(record);
    const int8_t existing = findCompletionIndex(ctx->out, ctx->count, record.planId);
    if (existing >= 0) {
        TodayPlanCompletion& completion = ctx->out[existing];
        completion.completedSec += runtimeSec;
        return;
    }
    if (ctx->count >= ctx->capacity) {
        return;
    }
    TodayPlanCompletion& completion = ctx->out[ctx->count++];
    completion.planId = record.planId;
    completion.completedSec = runtimeSec;
    completion.result = static_cast<Irrigation::TaskResult>(record.result);
}

uint8_t collectTodayPlanCompletions(uint8_t zoneId,
                                    uint32_t ymd,
                                    TodayPlanCompletion* out,
                                    uint8_t capacity) {
    if (!out || capacity == 0 || !PlanStore::validYmd(ymd)) {
        return 0;
    }
    for (uint8_t i = 0; i < capacity; ++i) {
        out[i] = {};
        out[i].result = Irrigation::TaskResult::NONE;
    }
    TodayRecordCollectContext ctx = {};
    ctx.zoneId = zoneId;
    ctx.ymd = ymd;
    ctx.out = out;
    ctx.capacity = capacity;
    (void)RecordStore::readLatest(0, RecordStore::Capacity, collectTodayPlanRecord, &ctx);
    return ctx.count;
}

const char* todayPlanPrimaryStatus(bool completed, bool running) {
    if (running) return "运行中";
    if (completed) return "完成";
    return "未完成";
}

