tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
const char* todayPlanReason(const TodayPlanDisplay& item) {
    if (item.running) return "正在执行";
    if (item.lastResult != Irrigation::TaskResult::NONE) return taskResultLabel(item.lastResult);
    switch (item.observation) {
        case Irrigation::PlanObservationStatus::NOT_EVALUATED: return "未到时间";
        case Irrigation::PlanObservationStatus::SKIPPED_CALENDAR: return "今日跳过";
        case Irrigation::PlanObservationStatus::SKIPPED_DISABLED: return "水路停用";
        case Irrigation::PlanObservationStatus::SKIPPED_BUSY: return "水路忙碌";
        case Irrigation::PlanObservationStatus::SKIPPED_ERROR: return "水路异常";
        case Irrigation::PlanObservationStatus::SKIPPED_LEAK: return "漏水保护";
        case Irrigation::PlanObservationStatus::SKIPPED_RESET: return "恢复出厂";
        case Irrigation::PlanObservationStatus::SKIPPED_CYCLE: return "非执行日";
        case Irrigation::PlanObservationStatus::SKIPPED_CONFIG_INVALID: return "配置无效";
        case Irrigation::PlanObservationStatus::REJECTED: return "启动拒绝";
        case Irrigation::PlanObservationStatus::MISSED: return "已错过";
        case Irrigation::PlanObservationStatus::STARTED: return "已启动，等待记录";
        default: return "";
    }
}

uint8_t collectTodayPlans(uint8_t zoneId,
                          uint32_t ymd,
                          TodayPlanDisplay* out,
                          uint8_t capacity,
                          TodayPlanSummary* summary) {
    if (summary) {
        *summary = {};
    }
    if (!out || capacity == 0 || !PlanStore::validYmd(ymd)) {
        return 0;
    }
    const Irrigation::ZoneStatus zoneStatus = ZoneManager::status(zoneId);
    TodayPlanCompletion completions[Irrigation::MaxPlansPerZone] = {};
    const uint8_t completionCount = collectTodayPlanCompletions(zoneId, ymd, completions, Irrigation::MaxPlansPerZone);
    uint8_t count = 0;
    for (uint8_t slot = 0; slot < Irrigation::MaxPlansPerZone && count < capacity; ++slot) {
        const Irrigation::PlanDefinition& plan = PlanStore::getBySlot(zoneId, slot);
        if (!plan.exists || !plan.enabled || !PlanStore::shouldRunOnDate(plan, ymd)) {
            continue;
        }
        TodayPlanDisplay item = {};
        item.exists = true;
        item.plan = plan;
        item.observation = planObservationFor(zoneId, plan, ymd);
        item.lastResult = Irrigation::TaskResult::NONE;
        item.running = zoneStatus.busy &&
                       zoneStatus.taskType == Irrigation::TaskType::PLAN &&
                       zoneStatus.planId == plan.planId;
        if (item.running) {
            item.completedSec = zoneStatus.elapsedSec;
        }
        const int8_t completionIndex = findCompletionIndex(completions, completionCount, plan.planId);
        if (completionIndex >= 0) {
            item.completed = todayPlanResultCompleted(completions[completionIndex].result);
            item.completedSec += completions[completionIndex].completedSec;
            item.lastResult = completions[completionIndex].result;
        }
        out[count++] = item;
        if (summary) {
            ++summary->total;
            summary->totalSec += plan.durationSec;
            summary->completedSec += item.completedSec;
            if (item.completed) {
                ++summary->completed;
            }
        }
    }
    return count;
}

void writeOverviewStyles() {
    Esp32BaseWeb::sendChunk("<style>"
".irr-overview-weather{display:grid;grid-template-columns:minmax(0,1.2fr) repeat(3,minmax(0,.7fr));gap:10px}"
".irr-weather-cell{border:1px solid var(--eb-line-soft);background:var(--eb-soft);border-radius:8px;padding:10px 11px;min-width:0}"
".irr-weather-value{display:block;font-size:20px;line-height:1.1;margin-bottom:6px}"
".irr-weather-cell span{display:block;color:var(--eb-muted);font-size:12px;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
".irr-zone-rows{display:grid;gap:10px}"
".irr-zone-row{display:grid;grid-template-columns:minmax(0,1.7fr) minmax(260px,.85fr);gap:10px;align-items:stretch}"
".irr-zone-card,.irr-plan-card{border:1px solid var(--eb-line);background:var(--eb-surface);border-radius:8px;padding:10px;min-width:0}"
".irr-zone-card.running,.irr-zone-row.running .irr-zone-card{border-color:#fdba74;background:#fffaf5}"
".irr-zone-card.error,.irr-zone-row.error .irr-zone-card{border-color:#fca5a5;background:#fffafa}"
".irr-zone-head{display:flex;justify-content:space-between;align-items:flex-start;gap:8px;margin-bottom:7px}"
".irr-zone-name{font-size:17px;font-weight:750;line-height:1.12;margin-bottom:2px}"
".irr-zone-task{color:var(--eb-muted);font-size:12px;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
".irr-zone-metrics{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:6px;margin-bottom:8px}"
".irr-zone-metric{border:1px solid var(--eb-line-soft);background:var(--eb-soft);border-radius:8px;padding:7px 8px;min-height:48px;min-width:0}"
".irr-zone-metric b{display:block;font-size:16px;line-height:1.05;margin-bottom:4px;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
".irr-zone-metric .label{display:block;color:var(--eb-muted);font-size:11px;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
".irr-chart-wrap{border:1px solid var(--eb-line-soft);border-radius:8px;background:#fff;padding:6px 8px;margin-bottom:8px}"
".irr-chart-head{display:flex;justify-content:space-between;gap:8px;margin-bottom:2px;color:var(--eb-muted);font-size:12px}"
".irr-flow-chart{width:100%;height:96px;display:block;border-radius:6px;background:linear-gradient(#fff,#f8fafc)}"
".irr-zone-footer{display:flex;align-items:center;justify-content:space-between;gap:8px;min-height:30px}"
".irr-zone-runtime{color:var(--eb-muted);font-size:12px;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
".irr-plan-card h3{font-size:15px;margin:0 0 8px}"
".irr-plan-summary{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:5px;margin-bottom:8px}"
".irr-plan-summary div{border:1px solid var(--eb-line-soft);background:var(--eb-soft);border-radius:7px;padding:5px 6px;min-width:0}"
".irr-plan-summary .value{display:block;font-size:14px;line-height:1.05;margin-bottom:3px;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
".irr-plan-summary span{display:block;color:var(--eb-muted);font-size:11px;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
".irr-plan-list{display:grid;gap:5px}"
".irr-plan-item{display:flex;justify-content:space-between;gap:8px;border-top:1px solid var(--eb-line-soft);padding-top:5px;min-width:0}"
".irr-plan-item:first-child{border-top:0;padding-top:0}"
".irr-plan-time{display:block;font-size:13px;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
".irr-plan-note{display:block;color:var(--eb-muted);font-size:12px;font-style:normal;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}"
".irr-plan-status{display:inline-flex;align-items:center;justify-content:center;min-height:21px;border:1px solid var(--eb-line);border-radius:7px;padding:0 6px;font-size:12px;font-weight:750;white-space:nowrap;align-self:flex-start}"
".irr-plan-status.done{border-color:#bbf7d0;background:#f0fdf4;color:#166534}"
".irr-plan-status.running{border-color:#fed7aa;background:#fff7ed;color:#9a3412}"
".irr-plan-status.pending{border-color:#bfdbfe;background:#eff6ff;color:#1d4ed8}"
"@media(max-width:760px){.irr-overview-weather{grid-template-columns:1fr}.irr-zone-row{grid-template-columns:1fr}.irr-zone-metrics,.irr-plan-summary{grid-template-columns:1fr}.irr-zone-footer{align-items:stretch;flex-direction:column}.irr-flow-chart{height:92px}}"
"</style>");
}

void writeHourMinuteHuman(uint32_t epoch) {
    if (epoch == 0) {
        Esp32BaseWeb::sendChunk("时间未同步");
        return;
    }
    const time_t value = static_cast<time_t>(epoch);
    tm local = {};
    if (localtime_r(&value, &local) == nullptr) {
        Esp32BaseWeb::sendChunk("时间无效");
        return;
    }
    char text[8];
    snprintf(text, sizeof(text), "%02d:%02d", local.tm_hour, local.tm_min);
    Esp32BaseWeb::sendChunk(text);
}

void writeWeatherStrip() {
    WeatherSnapshotStore::Snapshot weather = {};
    Esp32BaseWeb::beginPanel("天气预报");
    if (!WeatherSnapshotStore::get(&weather)) {
        Esp32BaseWeb::sendChunk("<p class='muted'>等待天气数据推送</p>");
        Esp32BaseWeb::endPanel();
        return;
    }
    Esp32BaseWeb::sendChunk("<div class='irr-overview-weather'><div class='irr-weather-cell'><span class='irr-weather-value'>");
    writeInt(weather.currentTempC);
    Esp32BaseWeb::sendChunk("°C · ");
    Esp32BaseWeb::writeHtmlEscaped(weather.condition);
    Esp32BaseWeb::sendChunk("</span><span>24 小时降雨 ");
    writeUInt(weather.rainProbability24hPercent);
    Esp32BaseWeb::sendChunk("% · 风力 ");
    writeUInt(weather.windLevel);
    Esp32BaseWeb::sendChunk(" 级</span>");
#if ESP32BASE_ENABLE_NTP
    const Esp32BaseNtp::TimeSnapshot timeSnapshot = Esp32BaseNtp::snapshot();
    if (!timeSnapshot.synced || timeSnapshot.epochSec == 0) {
        Esp32BaseWeb::sendChunk("<span>天气时间未确认</span>");
    } else if (WeatherSnapshotStore::isStale(weather, timeSnapshot.epochSec)) {
        Esp32BaseWeb::sendChunk("<span class='tag warn'>天气数据已过期</span>");
    } else if (weather.updatedEpoch != 0) {
        Esp32BaseWeb::sendChunk("<span>更新于 ");
        writeHourMinuteHuman(weather.updatedEpoch);
        Esp32BaseWeb::sendChunk("</span>");
    }
#else
    Esp32BaseWeb::sendChunk("<span>天气时间未确认</span>");
#endif
    Esp32BaseWeb::sendChunk("</div>");
    for (uint8_t i = 0; i < 3; ++i) {
        Esp32BaseWeb::sendChunk("<div class='irr-weather-cell'><span class='irr-weather-value'>");
        Esp32BaseWeb::writeHtmlEscaped(weather.days[i].label);
        Esp32BaseWeb::sendChunk("</span><span>");
        writeInt(weather.days[i].lowTempC);
        Esp32BaseWeb::sendChunk("-");
        writeInt(weather.days[i].highTempC);
        Esp32BaseWeb::sendChunk("°C</span><span>降雨 ");
        writeUInt(weather.days[i].rainProbabilityPercent);
        Esp32BaseWeb::sendChunk("%</span></div>");
    }
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::endPanel();
}

void writeTodayPlanCard(uint8_t zoneId, uint32_t ymd) {
    TodayPlanDisplay plans[Irrigation::MaxPlansPerZone] = {};
    TodayPlanSummary summary = {};
    const uint8_t count = collectTodayPlans(zoneId, ymd, plans, Irrigation::MaxPlansPerZone, &summary);
    Esp32BaseWeb::sendChunk("<aside class='irr-plan-card'><h3>今日计划</h3><div class='irr-plan-summary'><div><span class='value'>");
    writeUInt(summary.completed);
    Esp32BaseWeb::sendChunk(" / ");
    writeUInt(summary.total);
    Esp32BaseWeb::sendChunk("</span><span>完成进度</span></div><div><span class='value'>");
    writeUInt(summary.completedSec / 60UL);
    Esp32BaseWeb::sendChunk(" / ");
    writeUInt(summary.totalSec / 60UL);
    Esp32BaseWeb::sendChunk("分钟</span><span>已浇 / 总时长</span></div><div><span class='value'>");
    const uint32_t remainingSec = summary.totalSec > summary.completedSec ? summary.totalSec - summary.completedSec : 0;
    writeUInt(remainingSec / 60UL);
    Esp32BaseWeb::sendChunk("分钟</span><span>剩余时长</span></div></div><div class='irr-plan-list'>");
    if (count == 0) {
        Esp32BaseWeb::sendChunk("<div class='irr-plan-item'><div><span class='irr-plan-time'>无启用计划</span><em class='irr-plan-note'>这一路今天不会自动浇水</em></div></div>");
    }
    for (uint8_t i = 0; i < count; ++i) {
        const TodayPlanDisplay& item = plans[i];
        const char* primary = todayPlanPrimaryStatus(item.completed, item.running);
        const char* reason = todayPlanReason(item);
        Esp32BaseWeb::sendChunk("<div class='irr-plan-item'><div><span class='irr-plan-time'>");
        writeTime(item.plan.timeHour, item.plan.timeMinute);
        Esp32BaseWeb::sendChunk(" · ");
        writeDuration(item.plan.durationSec);
        Esp32BaseWeb::sendChunk("</span><em class='irr-plan-note'>");
        Esp32BaseWeb::writeHtmlEscaped(reason);
        Esp32BaseWeb::sendChunk("</em></div><span class='irr-plan-status ");
        Esp32BaseWeb::sendChunk(strcmp(primary, "完成") == 0 ? "done" : (strcmp(primary, "运行中") == 0 ? "running" : "pending"));
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::writeHtmlEscaped(primary);
        Esp32BaseWeb::sendChunk("</span></div>");
    }
    Esp32BaseWeb::sendChunk("</div></aside>");
}

const char* overviewCardStateClass(const Irrigation::ZoneStatus& status) {
    if (status.errorActive) return " error";
    if (status.busy) return " running";
    return "";
}

void writeZoneMetric(uint8_t zoneId, const char* attr, const char* label, const char* value) {
    Esp32BaseWeb::sendChunk("<div class='irr-zone-metric'><b");
    if (attr && attr[0]) {
        Esp32BaseWeb::sendChunk(" ");
        Esp32BaseWeb::sendChunk(attr);
        Esp32BaseWeb::sendChunk("='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'");
    }
    Esp32BaseWeb::sendChunk(">");
    Esp32BaseWeb::writeHtmlEscaped(value);
    Esp32BaseWeb::sendChunk("</b><span class='label'>");
    Esp32BaseWeb::writeHtmlEscaped(label);
    Esp32BaseWeb::sendChunk("</span></div>");
}

