tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
const char* observationStatusLabel(Irrigation::PlanObservationStatus status) {
    switch (status) {
        case Irrigation::PlanObservationStatus::STARTED: return "计划已启动";
        case Irrigation::PlanObservationStatus::SKIPPED_CALENDAR: return "当天已设置跳过";
        case Irrigation::PlanObservationStatus::SKIPPED_DISABLED: return "计划或水路已停用";
        case Irrigation::PlanObservationStatus::SKIPPED_BUSY: return "水路正在执行其他任务";
        case Irrigation::PlanObservationStatus::SKIPPED_ERROR: return "水路处于异常状态";
        case Irrigation::PlanObservationStatus::SKIPPED_LEAK: return "因漏水告警跳过";
        case Irrigation::PlanObservationStatus::SKIPPED_RESET: return "恢复出厂中跳过";
        case Irrigation::PlanObservationStatus::SKIPPED_CYCLE: return "非本轮执行日";
        case Irrigation::PlanObservationStatus::SKIPPED_CONFIG_INVALID: return "配置无效，未执行";
        case Irrigation::PlanObservationStatus::REJECTED: return "启动被拒绝";
        case Irrigation::PlanObservationStatus::MISSED: return "系统发现计划已错过";
        case Irrigation::PlanObservationStatus::NOT_EVALUATED:
        default: return "未评估";
    }
}

void sendMetricCard(const char* label, const char* value, const char* help, const char* tone = nullptr, const char* id = nullptr) {
    Esp32BaseWeb::sendChunk("<div class='metric");
    if (tone && tone[0]) {
        Esp32BaseWeb::sendChunk(" ");
        Esp32BaseWeb::writeHtmlEscaped(tone);
    }
    Esp32BaseWeb::sendChunk("'");
    if (id && id[0]) {
        Esp32BaseWeb::sendChunk(" id='");
        Esp32BaseWeb::writeHtmlEscaped(id);
        Esp32BaseWeb::sendChunk("'");
    }
    if (tone && strcmp(tone, "danger") == 0) {
        Esp32BaseWeb::sendChunk(" style='border-color:#efc0ba;background:var(--eb-danger-soft);color:var(--eb-danger)'");
    }
    Esp32BaseWeb::sendChunk("><b>");
    Esp32BaseWeb::writeHtmlEscaped(value ? value : "");
    Esp32BaseWeb::sendChunk("</b><span>");
    Esp32BaseWeb::writeHtmlEscaped(label ? label : "");
    if (help && help[0]) {
        Esp32BaseWeb::sendChunk(" · ");
        Esp32BaseWeb::writeHtmlEscaped(help);
    }
    Esp32BaseWeb::sendChunk("</span></div>");
}

const char* appEventLevelLabel(uint8_t level) {
    switch (level) {
        case Esp32BaseAppEventLog::LEVEL_INFO: return "信息";
        case Esp32BaseAppEventLog::LEVEL_WARN: return "注意";
        case Esp32BaseAppEventLog::LEVEL_ERROR: return "故障";
        default: return "未知";
    }
}

const char* appEventSourceLabel(const char* source) {
    if (!source || !source[0]) return "-";
    if (strcmp(source, "web") == 0) return "网页";
    if (strcmp(source, "api") == 0) return "API";
    if (strcmp(source, "button") == 0) return "本地按键";
    if (strcmp(source, "schedule") == 0) return "计划";
    if (strcmp(source, "monitor") == 0) return "监控";
    if (strcmp(source, "runtime") == 0) return "运行保护";
    if (strcmp(source, "storage") == 0) return "存储";
    return "其他来源";
}

const char* appEventTypeLabel(const char* type) {
    if (!type || !type[0]) return "-";
    if (strcmp(type, "schedule_skipped") == 0) return "计划跳过";
    if (strcmp(type, "schedule_unskipped") == 0) return "取消跳过";
    if (strcmp(type, "schedule_tracker_fault") == 0) return "计划跟踪异常";
    if (strcmp(type, "flow_fault") == 0) return "流量异常";
    if (strcmp(type, "leak_detected") == 0) return "漏水检测";
    if (strcmp(type, "zone_locked") == 0) return "水路锁定";
    if (strcmp(type, "alert_cleared") == 0) return "告警清除";
    if (strcmp(type, "safety_stop") == 0) return "安全停止";
    if (strcmp(type, "factory_reset") == 0) return "恢复出厂";
    if (strcmp(type, "flow_params_applied") == 0) return "流量参数应用";
    if (strcmp(type, "flow_params_restored") == 0) return "流量参数恢复";
    if (strcmp(type, "record_store_recovered") == 0) return "浇水记录修复";
    if (strcmp(type, "record_store_fault") == 0) return "浇水记录异常";
    if (strcmp(type, "config_schema_reset") == 0) return "配置格式更新";
    if (strcmp(type, "web_route_fault") == 0) return "网页注册异常";
    return "其他业务事件";
}

uint8_t zoneIdFromEventObject(const char* object) {
    if (!object || strncmp(object, "zone:", 5) != 0) {
        return 0;
    }
    const unsigned long raw = strtoul(object + 5, nullptr, 10);
    return raw <= 255UL ? static_cast<uint8_t>(raw) : 0;
}

uint8_t eventZoneId(const Esp32BaseAppEventRecord& event) {
    const uint8_t direct = zoneIdFromEventObject(event.object);
    if (Irrigation::validZoneId(direct)) {
        return direct;
    }
    if (strcmp(event.type, "schedule_skipped") == 0 &&
        strcmp(event.source, "schedule") == 0 &&
        (event.valueMask & Esp32BaseAppEventLog::VALUE1) &&
        event.value1 >= 1 &&
        event.value1 <= Irrigation::MaxZones) {
        return static_cast<uint8_t>(event.value1);
    }
    return 0;
}

void writeEventZoneName(uint8_t zoneId) {
    if (Irrigation::validZoneId(zoneId)) {
        Esp32BaseWeb::writeHtmlEscaped(ZoneManager::config(zoneId).name);
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
}

void writeEventDetailValue(const char* label, int32_t value, const char* unit = nullptr) {
    Esp32BaseWeb::sendChunk("；");
    Esp32BaseWeb::writeHtmlEscaped(label);
    Esp32BaseWeb::sendChunk(" ");
    char text[16];
    snprintf(text, sizeof(text), "%ld", static_cast<long>(value));
    Esp32BaseWeb::writeHtmlEscaped(text);
    if (unit && unit[0]) {
        Esp32BaseWeb::sendChunk(" ");
        Esp32BaseWeb::writeHtmlEscaped(unit);
    }
}

void writeEventDetailYmd(const char* label, int32_t value) {
    Esp32BaseWeb::sendChunk("；");
    Esp32BaseWeb::writeHtmlEscaped(label);
    Esp32BaseWeb::sendChunk(" ");
    const uint32_t ymd = static_cast<uint32_t>(value);
    if (value > 0 && PlanStore::validYmd(ymd)) {
        writeYmdInput(ymd);
    } else {
        writeInt(value);
    }
}

uint16_t highU16(int32_t packed) {
    return static_cast<uint16_t>((static_cast<uint32_t>(packed) >> 16) & 0xFFFFUL);
}

uint16_t lowU16(int32_t packed) {
    return static_cast<uint16_t>(static_cast<uint32_t>(packed) & 0xFFFFUL);
}

void writeEventFlowParamsChange(const Esp32BaseAppEventRecord& event, const char* action) {
    Esp32BaseWeb::writeHtmlEscaped(action);
    if ((event.valueMask & (Esp32BaseAppEventLog::VALUE1 | Esp32BaseAppEventLog::VALUE2 | Esp32BaseAppEventLog::VALUE3)) !=
        (Esp32BaseAppEventLog::VALUE1 | Esp32BaseAppEventLog::VALUE2 | Esp32BaseAppEventLog::VALUE3)) {
        return;
    }
    Esp32BaseWeb::sendChunk("；启动脉冲 ");
    writeUInt(highU16(event.value1));
    Esp32BaseWeb::sendChunk(" -> ");
    writeUInt(highU16(event.value2));
    Esp32BaseWeb::sendChunk("；启动估算水量 ");
    writeUInt(lowU16(event.value1));
    Esp32BaseWeb::sendChunk(" -> ");
    writeUInt(lowU16(event.value2));
    Esp32BaseWeb::sendChunk(" ml；稳定系数 ");
    writeUInt(highU16(event.value3));
    Esp32BaseWeb::sendChunk(" -> ");
    writeUInt(lowU16(event.value3));
    Esp32BaseWeb::sendChunk(" 脉冲/L");
}

