tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
    char runningText[16];
    char errorText[16];
    char safetyText[24];
    char todayPlanText[16];
    snprintf(runningText, sizeof(runningText), "%u / %u", static_cast<unsigned>(runningCount), static_cast<unsigned>(enabledCount));
    snprintf(errorText, sizeof(errorText), "%u", static_cast<unsigned>(errorCount));
    snprintf(todayPlanText, sizeof(todayPlanText), "%u", static_cast<unsigned>(todayPlanCount));
    if (ZoneManager::leakAlertActive()) {
        strlcpy(safetyText, "漏水告警", sizeof(safetyText));
    } else if (errorCount > 0) {
        snprintf(safetyText, sizeof(safetyText), "%u 路异常", static_cast<unsigned>(errorCount));
    } else {
        strlcpy(safetyText, "正常", sizeof(safetyText));
    }

    Esp32BaseWeb::beginPanel("关键指标");
    Esp32BaseWeb::beginMetricGrid();
    sendMetricCard("系统状态", safetyText, ZoneManager::leakAlertActive() ? "请先到现场确认是否漏水" : "可以按计划或手动浇水", ZoneManager::leakAlertActive() ? "danger" : nullptr, "irrMetricSafety");
    sendMetricCard("正在浇水", runningText, "正在执行 / 已启用水路", nullptr, "irrMetricRunning");
    sendMetricCard("今日计划", todayPlanText, todayPlanCount > 0 ? "今天会按计划自动检查" : "今天没有启用的自动计划", nullptr, "irrMetricTodayPlans");
    sendMetricCard("异常提醒", errorText, errorCount > 0 ? "处理后可在水路状态中清除" : "没有需要处理的水路异常", errorCount > 0 ? "danger" : nullptr, "irrMetricErrors");
    Esp32BaseWeb::endMetricGrid();
    Esp32BaseWeb::endPanel();

    writeOverviewStyles();
    writeWeatherStrip();

    Esp32BaseWeb::beginPanel("水路状态");
    Esp32BaseWeb::sendChunk("<div class='irr-zone-rows'>");
    bool wroteStatus = false;
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        if (!status.enabled) {
            continue;
        }
        wroteStatus = true;
        writeZoneOverviewRow(zoneId, status, todayYmd);
    }
    Esp32BaseWeb::sendChunk("</div>");
    if (!wroteStatus) {
        Esp32BaseWeb::sendChunk("<p class='muted'>暂无启用水路</p>");
    }
    Esp32BaseWeb::sendChunk("<div class='actions'><form method='post' action='/api/v1/zones/stop-all' onsubmit=\"return confirm('确认停止全部水路？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<input id='irrStopAll' class='danger' type='submit' value='全部停止'");
    Esp32BaseWeb::sendChunk(runningCount > 0 ? "" : " disabled");
    Esp32BaseWeb::sendChunk("></form></div>");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        if (status.enabled && status.errorActive) {
            writeZoneErrorDialog(zoneId, ZoneManager::config(zoneId), ZoneErrorStore::get(zoneId));
        }
    }
    Esp32BaseWeb::sendChunk("<script>"
                            "function irrFaultOpen(id){var d=document.getElementById(id);if(!d)return;if(d.showModal)d.showModal();else d.setAttribute('open','open');}"
                            "function irrFaultClose(b){var d=b&&b.closest?b.closest('dialog'):null;if(d&&d.close)d.close();else if(d)d.removeAttribute('open');}"
                            "function irrOverviewDuration(s){s=parseInt(s||0,10)||0;var h=Math.floor(s/3600),m=Math.floor((s%3600)/60),r=s%60,t='';if(h)t+=h+'小时';if(m)t+=m+'分钟';if(r||!t)t+=r+'秒';return t;}"
                            "function irrOverviewLiters(ml){ml=parseInt(ml||0,10)||0;return Math.floor(ml/1000)+'.'+('00'+(ml%1000)).slice(-3)+' L';}"
                            "function irrOverviewFlow(v,ready,busy){v=parseInt(v||0,10)||0;if(!busy||!ready)return '-';return Math.floor(v/1000)+'.'+('00'+(v%1000)).slice(-3)+' L/min';}"
                            "function irrOverviewEscape(s){return String(s||'').replace(/[&<>\"']/g,function(c){return {'&':'&amp;','<':'&lt;','>':'&gt;','\"':'&quot;',\"'\":'&#39;'}[c];});}"
                            "function irrOverviewStateLabel(s){return {disabled:'已禁用',idle:'待机',starting:'启动中',running:'浇水中',error:'异常'}[s]||'未知';}"
                            "function irrOverviewStateTone(s){return s==='running'||s==='starting'?' warn':(s==='error'?' danger':(s==='idle'?' ok':''));}"
                            "function irrOverviewSetMetric(id,value){var e=document.querySelector('#'+id+' b');if(e)e.textContent=value;}"
                            "function irrOverviewRefreshMs(data){if(document.hidden)return 60000;return data&&data.zones&&data.zones.some(function(z){return z.busy;})?1000:30000;}"
                            "function irrOverviewInitialFast(){return !!document.querySelector('[data-irr-zone-row][data-busy=\"1\"]');}"
                            "function irrOverviewRenderState(z){var e=document.querySelector('[data-irr-state=\"'+z.zoneId+'\"]');if(!e)return;if(z.errorActive){e.innerHTML='<button type=\"button\" class=\"tag danger\" style=\"border:0;cursor:pointer\" onclick=\"irrFaultOpen(\\'irrFaultDialog'+z.zoneId+'\\')\">'+irrOverviewEscape(irrOverviewStateLabel(z.state))+'</button>';return;}e.innerHTML='<span class=\"tag'+irrOverviewStateTone(z.state)+'\">'+irrOverviewEscape(irrOverviewStateLabel(z.state))+'</span>';}"
                            "function irrOverviewRenderActions(row,z,leak){var e=document.querySelector('[data-irr-actions=\"'+z.zoneId+'\"]');if(!e)return;var name=irrOverviewEscape(row.dataset.zoneName||('水路 '+z.zoneId));if(z.busy){e.innerHTML='<form method=\"post\" action=\"/api/v1/zone/stop\" onsubmit=\"return confirm(\\'确认停止该水路？\\')&&once(this)\"><input type=\"hidden\" name=\"source\" value=\"web_page\"><input type=\"hidden\" name=\"zoneId\" value=\"'+z.zoneId+'\"><input class=\"fsaction\" type=\"submit\" value=\"停止\"></form>';return;}if(z.errorActive){e.innerHTML='<form method=\"post\" action=\"/api/v1/zone/clear-error\" onsubmit=\"return confirm(\\'确认清除该水路异常？\\')&&once(this)\"><input type=\"hidden\" name=\"source\" value=\"web_page\"><input type=\"hidden\" name=\"zoneId\" value=\"'+z.zoneId+'\"><input class=\"fsaction\" type=\"submit\" value=\"清除异常\"></form>';return;}e.innerHTML=leak?'<span class=\"muted\">漏水告警中</span>':'<button class=\"btnlink compact ok\" type=\"button\" data-zone-id=\"'+z.zoneId+'\" data-zone-name=\"'+name+'\" onclick=\"irrManualOpen(this)\">启动</button>';}"
                            "function irrFlowChartDraw(id,points,historyMin){var svg=document.getElementById('irrFlowChart'+id);if(!svg)return;points=points||[];historyMin=parseInt(historyMin||10,10)||10;var rect=svg.getBoundingClientRect?svg.getBoundingClientRect():{width:640};var w=Math.max(420,Math.round(rect.width||640)),h=96;svg.setAttribute('viewBox','0 0 '+w+' '+h);var max=0;for(var i=0;i<points.length;i++)max=Math.max(max,parseInt(points[i]||0,10)||0);var yMax=Math.max(2000,Math.ceil(max/500)*500);var left=44,right=12,top=14,bottom=22,plotW=w-left-right,plotH=h-top-bottom;var html='';for(var gy=0;gy<=4;gy++){var value=Math.round((yMax*gy)/4),y=top+plotH-(plotH*gy/4);html+='<line x1=\"'+left+'\" y1=\"'+y+'\" x2=\"'+(w-right)+'\" y2=\"'+y+'\" stroke=\"#e2e8f0\" vector-effect=\"non-scaling-stroke\"/>';html+='<text x=\"'+(left-8)+'\" y=\"'+(y+3)+'\" text-anchor=\"end\" fill=\"#64748b\" font-size=\"10\">'+(value/1000).toFixed(value%1000?1:0)+'</text>';}var labels=7;for(var tx=0;tx<labels;tx++){var x=left+(plotW*tx/(labels-1)),min=Math.round(-historyMin+(historyMin*tx/(labels-1)));html+='<line x1=\"'+x+'\" y1=\"'+(top+plotH)+'\" x2=\"'+x+'\" y2=\"'+(top+plotH+3)+'\" stroke=\"#cbd5e1\" vector-effect=\"non-scaling-stroke\"/>';html+='<text x=\"'+x+'\" y=\"'+(h-6)+'\" text-anchor=\"middle\" fill=\"#64748b\" font-size=\"10\">'+(tx===labels-1?'现在':String(min))+'</text>';}html+='<line x1=\"'+left+'\" y1=\"'+top+'\" x2=\"'+left+'\" y2=\"'+(top+plotH)+'\" stroke=\"#94a3b8\" vector-effect=\"non-scaling-stroke\"/>';html+='<line x1=\"'+left+'\" y1=\"'+(top+plotH)+'\" x2=\"'+(w-right)+'\" y2=\"'+(top+plotH)+'\" stroke=\"#94a3b8\" vector-effect=\"non-scaling-stroke\"/>';html+='<text x=\"6\" y=\"11\" fill=\"#64748b\" font-size=\"10\">L/min</text>';if(points.length>=2&&max>0){var d='';for(var j=0;j<points.length;j++){var px=left+(plotW*j/(points.length-1));var py=top+plotH-((parseInt(points[j]||0,10)||0)*plotH/yMax);d+=(j?'L':'M')+px.toFixed(1)+' '+py.toFixed(1);}html+='<path d=\"'+d+' L'+(w-right)+' '+(top+plotH)+' L'+left+' '+(top+plotH)+' Z\" fill=\"#0f766e\" opacity=\".07\"/>';html+='<path d=\"'+d+'\" fill=\"none\" stroke=\"#0f766e\" stroke-width=\"2\" vector-effect=\"non-scaling-stroke\"/>';}else{html+='<line x1=\"'+left+'\" y1=\"'+(top+plotH)+'\" x2=\"'+(w-right)+'\" y2=\"'+(top+plotH)+'\" stroke=\"#cbd5e1\" stroke-width=\"1.5\" vector-effect=\"non-scaling-stroke\"/>';html+='<text x=\"'+(left+plotW/2)+'\" y=\"'+(top+plotH/2+4)+'\" text-anchor=\"middle\" fill=\"#94a3b8\" font-size=\"11\">无流速</text>';}svg.innerHTML=html;}"
                            "function irrFlowChart(id,busy){if(!busy){irrFlowChartDraw(id,[],10);return;}fetch('/api/v1/flow/history?zoneId='+id,{headers:{Accept:'application/json'},credentials:'same-origin'}).then(function(r){return r.ok?r.json():null;}).then(function(j){if(!j||!j.ok)return;irrFlowChartDraw(id,j.flowHistory||[],j.historyMin||10);var label=document.querySelector('[data-irr-flow-chart-label=\"'+id+'\"]');if(label)label.textContent=String(j.historyMin||'')+' 分钟';}).catch(function(){});}"
                            "function irrOverviewApplyStatus(data){if(!data||!data.ok||!data.zones)return;var enabled=0,running=0,errors=0,structural=false;data.zones.forEach(function(z){if(!z.enabled)return;enabled++;if(z.busy)running++;if(z.errorActive)errors++;var row=document.querySelector('[data-irr-zone-row=\"'+z.zoneId+'\"]');if(!row){structural=true;return;}var busy=z.busy?'1':'0',err=z.errorActive?'1':'0';if(row.dataset.error!==err){structural=true;return;}row.dataset.state=z.state;row.dataset.busy=busy;row.dataset.error=err;row.classList.toggle('running',!!z.busy);row.classList.toggle('error',!!z.errorActive);irrOverviewRenderState(z);var e=document.querySelector('[data-irr-task=\"'+z.zoneId+'\"]');if(e)e.textContent=z.busy?(z.taskLabel||'浇水中'):(z.errorActive?(z.errorCode||'水路异常'):'无运行任务');e=document.querySelector('[data-irr-remaining=\"'+z.zoneId+'\"]');if(e)e.textContent=z.busy?irrOverviewDuration(z.remainingSec):'-';e=document.querySelector('[data-irr-flow=\"'+z.zoneId+'\"]');if(e)e.textContent=irrOverviewFlow(z.flowMlPerMin,z.flowRateReady,z.busy);e=document.querySelector('[data-irr-ml=\"'+z.zoneId+'\"]');if(e)e.textContent=z.busy?irrOverviewLiters(z.estimatedMl):'-';e=document.querySelector('[data-irr-runtime=\"'+z.zoneId+'\"]');if(e)e.textContent=z.busy?('已运行 '+irrOverviewDuration(z.elapsedSec)+' / 目标 '+irrOverviewDuration(z.targetSec)):'当前无运行任务';irrFlowChart(z.zoneId,z.busy);irrOverviewRenderActions(row,z,data.leakAlertActive);});if(enabled!==document.querySelectorAll('[data-irr-zone-row]').length)structural=true;if(structural){location.reload();return;}irrOverviewSetMetric('irrMetricRunning',running+' / '+enabled);irrOverviewSetMetric('irrMetricErrors',String(errors));irrOverviewSetMetric('irrMetricSafety',data.leakAlertActive?'漏水告警':(errors>0?errors+' 路异常':'正常'));var stop=document.getElementById('irrStopAll');if(stop)stop.disabled=running<=0;}"
                            "var irrOverviewTimer=0;function irrOverviewSchedule(ms){if(irrOverviewTimer)clearTimeout(irrOverviewTimer);irrOverviewTimer=setTimeout(irrOverviewPoll,ms);}"
                            "function irrOverviewPoll(){fetch('/api/v1/status',{headers:{Accept:'application/json'},credentials:'same-origin'}).then(function(r){return r.ok?r.json():null;}).then(function(j){irrOverviewApplyStatus(j);irrOverviewSchedule(irrOverviewRefreshMs(j));}).catch(function(){irrOverviewSchedule(45000);});}"
                            "function irrOverviewPollNow(){irrOverviewSchedule(0);}"
                            "document.querySelectorAll('[data-irr-zone-row]').forEach(function(row){irrFlowChart(parseInt(row.getAttribute('data-irr-zone-row'),10),row.dataset.busy==='1');});"
                            "irrOverviewSchedule(irrOverviewInitialFast()?1000:30000);"
                            "</script>");
    writeManualStartDialog();
    Esp32BaseWeb::endPanel();
    pageFooter();
}

