tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void handleCalibrationPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    const Irrigation::SystemConfig& system = SystemConfigStore::current();
    FlowCalibration::StatusSnapshot calibrationSnapshot = {};
    FlowCalibration::status(&calibrationSnapshot);
    pageHeader("流量校准");
    Esp32BaseWeb::sendPageTitle("流量校准", "按现场水压和管路条件采集样本，自动计算启动阶段和稳定阶段流量参数。");
    if (FlowCalibration::lastError()[0] != '\0') {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "校准提示", FlowCalibration::lastError());
    }
    writeFlowParameterLineStyle();
    Esp32BaseWeb::sendChunk("<style>"
                            ".calibration-metrics{display:grid;grid-template-columns:repeat(auto-fit,minmax(150px,1fr));gap:10px;margin:8px 0 12px}"
                            ".calibration-metrics .metric b{font-weight:600}"
                            ".calibration-zone-list{display:grid;grid-template-columns:1fr;gap:10px}"
                            ".calibration-zone-row{border:1px solid var(--eb-line);border-radius:8px;padding:10px;background:var(--eb-surface);display:grid;grid-template-columns:minmax(86px,120px) minmax(0,1fr);gap:10px;align-items:start}"
                            ".calibration-zone-head{display:flex;justify-content:space-between;gap:8px;align-items:flex-start;margin-bottom:0}"
                            ".calibration-zone-head h3{margin:0 0 6px;font-size:1rem;font-weight:600}"
                            ".calibration-param-grid{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:8px}"
                            ".calibration-param-card{border:1px solid var(--eb-line-soft);border-radius:8px;background:var(--eb-soft);padding:8px;min-width:0}"
                            ".calibration-param-card.current{background:#fff}"
                            ".calibration-param-head{display:flex;justify-content:space-between;gap:6px;align-items:center;margin-bottom:4px}"
                            ".calibration-param-head h4{margin:0;font-size:.86rem;font-weight:500;color:var(--eb-muted)}"
                            ".calibration-param-head form{margin:0}"
                            ".calibration-param-head .btnlink{white-space:nowrap}"
                            ".calibration-param-card.candidate,.calibration-param-card.previous{font-size:13px}"
                            ".calibration-param-card.candidate .calibration-param-line .param,.calibration-param-card.previous .calibration-param-line .param{font-size:12px}"
                            ".calibration-param-note{margin:4px 0 0;color:var(--eb-muted);font-size:12px;line-height:1.35}"
                            ".calibration-internal{display:flex;flex-wrap:wrap;gap:8px;margin:8px 0;color:var(--eb-muted);font-size:.92rem}"
                            ".calibration-internal span{border:1px solid var(--eb-line-soft);border-radius:8px;padding:6px 9px;background:var(--eb-soft)}"
                            ".calibration-compact-workflow{display:grid;grid-template-columns:minmax(260px,1fr) minmax(260px,1fr);gap:10px;align-items:start}"
                            ".calibration-stage{border:1px solid var(--eb-line-soft);border-radius:8px;padding:10px;background:var(--eb-soft);min-height:126px;display:flex;flex-direction:column;gap:8px}"
                            ".calibration-stage h3{margin:0 0 6px;font-size:.9rem;font-weight:500;color:var(--eb-muted)}"
                            ".calibration-stage p{margin:4px 0}"
                            ".calibration-stage .tag{margin-left:0}"
                            ".calibration-stage-control{display:flex;flex-wrap:wrap;gap:8px;align-items:end}"
                            ".calibration-stage-control form{margin:0}"
                            ".calibration-stage-disabled{opacity:.58}"
                            ".calibration-stage-disabled input,.calibration-stage-disabled select{cursor:not-allowed}"
                            ".calibration-stage-note{margin-top:auto;color:var(--eb-muted);font-size:12px;line-height:1.35}"
                            ".calibration-inline-form{display:flex;flex-wrap:wrap;gap:8px;align-items:end}"
                            ".calibration-inline-form .field{margin:0;min-width:150px}"
                            ".calibration-inline-form input,.calibration-inline-form select{margin:0}"
                            ".calibration-actions{display:grid;grid-template-columns:repeat(auto-fit,minmax(220px,1fr));gap:12px;align-items:end}"
                            ".calibration-actions form{margin:0}"
                            ".calibration-actions .field{margin:0}"
                            ".calibration-progress{display:grid;grid-template-columns:repeat(auto-fit,minmax(132px,1fr));gap:8px;margin:10px 0 0}"
                            ".calibration-progress span{border:1px solid var(--eb-line-soft);border-radius:8px;background:#fff;padding:8px 10px;min-width:0}"
                            ".calibration-progress b{display:block;color:var(--eb-muted);font-size:12px;font-weight:500;margin-bottom:2px}"
                            ".calibration-progress strong{display:block;color:var(--eb-ink);font-size:15px;font-weight:600;overflow-wrap:anywhere}"
                            ".calibration-current-params{display:grid;grid-template-columns:repeat(2,minmax(0,1fr));gap:8px;margin-top:10px}"
                            ".calibration-current-params .calibration-param-card{background:#fff}"
                            ".calibration-current-params .full{grid-column:1/-1}"
                            ".calibration-section-title{margin:10px 0 0;font-size:.9rem;font-weight:600;color:var(--eb-muted)}"
                            ".calibration-panel-actions{display:flex;justify-content:flex-end;align-items:center;gap:8px;flex-wrap:wrap;margin:12px 0 0}"
                            ".calibration-panel-actions form{margin:0}"
                            ".calibration-action-note{color:var(--eb-muted);font-size:12px}"
                            ".calibration-sample-head{display:flex;justify-content:flex-end;align-items:center;margin:0 0 8px}"
                            ".calibration-sample-summary{color:var(--eb-muted);font-size:12px;line-height:1.35;text-align:right}"
                            ".calibration-sample-actions{display:flex;flex-wrap:wrap;gap:8px;align-items:center}"
                            ".calibration-note{border:1px solid var(--eb-line-soft);border-radius:8px;background:var(--eb-soft);padding:10px 12px;margin:12px 0;color:var(--eb-muted)}"
                            ".calibration-note code{color:var(--eb-ink)}"
                            ".calibration-dialog{border:1px solid var(--eb-line);border-radius:8px;padding:16px;max-width:420px;width:calc(100% - 32px)}"
                            ".calibration-dialog::backdrop{background:rgba(15,23,42,.35)}"
                            ".calibration-candidate-dialog{max-width:560px}"
                            ".calibration-candidate-dialog .field.short{grid-column:span 4}"
                            ".calibration-copy-fill{border:1px solid var(--eb-line-soft);border-radius:8px;background:var(--eb-soft);padding:10px;margin:10px 0}"
                            ".calibration-copy-fill label{display:block;margin:0 0 6px;color:var(--eb-muted);font-size:13px}"
                            ".calibration-fill-row{display:flex;flex-wrap:wrap;gap:8px;align-items:center}"
                            ".calibration-fill-row select{width:auto;margin:0}"
                            "@media(max-width:920px){.calibration-zone-row{grid-template-columns:1fr}.calibration-param-grid{grid-template-columns:1fr}.calibration-compact-workflow{grid-template-columns:1fr}.calibration-current-params{grid-template-columns:1fr}}"
                            "@media(max-width:720px){.calibration-candidate-dialog .field.short{grid-column:1/-1}}"
                            "</style>");
    writeFlowParameterLifecyclePanel();

    Esp32BaseWeb::beginPanel("校准配置");
    Esp32BaseWeb::sendChunk("<div class='calibration-metrics'>");
    char text[32];
    snprintf(text, sizeof(text), "%u 条", static_cast<unsigned>(system.calibrationSampleTarget));
    sendMetricCard("样本容量", text, "只限制新增样本");
    snprintf(text, sizeof(text), "%u 分钟", static_cast<unsigned>(system.calibrationMaxCaptureMin));
    sendMetricCard("单次最长", text, "超时样本无效");
    snprintf(text, sizeof(text), "%u 秒", static_cast<unsigned>(system.calibrationDetailCaptureSec));
    sendMetricCard("明细采集", text, "原始脉冲时间差");
    snprintf(text, sizeof(text), "%u 个", static_cast<unsigned>(system.calibrationDetailPulseLimit));
    sendMetricCard("明细脉冲上限", text, "只限制明细");
    Esp32BaseWeb::sendChunk("</div><div class='calibration-internal'><span>稳定窗口 2000 ms</span><span>滑动步进 200 ms</span><span>连续窗口 5</span><span>波动阈值 10%</span><span>稳定扫描从 1000 ms 开始</span></div><div class='actions'><a class='btnlink secondary' href='/esp32base/app-config'>修改校准配置</a></div>");
    Esp32BaseWeb::endPanel();

    const uint8_t selectedZoneId = Irrigation::validZoneId(calibrationSnapshot.activeZoneId) ? calibrationSnapshot.activeZoneId : 1;
    const uint8_t progressZoneId = selectedZoneId;
    const uint32_t progressEstimatedMl = progressZoneId == 0 ? 0 : estimateMlFromFlowPulses(calibrationSnapshot.currentPulses, ZoneManager::config(progressZoneId).flow);
    const uint32_t progressFlowMlPerMin = progressZoneId == 0 ? 0 : FlowMeter::flowMillilitersPerMinute(progressZoneId);
    const bool progressFlowReady = progressZoneId != 0 && FlowMeter::flowRateReady(progressZoneId);
    const Irrigation::ZoneConfig& selectedZone = ZoneManager::config(selectedZoneId);
    const bool selectedCandidateMatches = selectedZone.candidateFlow.exists &&
                                          ZoneConfigStore::flowParametersEqual(selectedZone.flow, selectedZone.candidateFlow.params);
    const bool calibrationCapturing = FlowCalibration::state() == FlowCalibration::State::CAPTURING;
    const bool calibrationWaitingActual = FlowCalibration::state() == FlowCalibration::State::WAITING_ACTUAL;
    const bool calibrationSampleFull = FlowCalibration::sampleCount() >= system.calibrationSampleTarget;
    const bool canStartCapture = !calibrationCapturing && !calibrationWaitingActual && !calibrationSampleFull;
    const bool canStopCapture = calibrationCapturing;
    const bool canSaveCaptureSample = calibrationWaitingActual;

    Esp32BaseWeb::beginPanel("采集样本");
    Esp32BaseWeb::sendChunk("<div id='calibrationCollectPanel'><div class='calibration-compact-workflow'><div class='calibration-stage'><h3>接水操作</h3>");
    Esp32BaseWeb::sendChunk("<div class='calibration-stage-control'><form class='calibration-inline-form");
    if (!canStartCapture) {
        Esp32BaseWeb::sendChunk(" calibration-stage-disabled");
    }
    Esp32BaseWeb::sendChunk("' method='post' action='/api/v1/calibration/start' onsubmit=\"return confirm('确认开始校准出水？')&&once(this)&&calibrationSubmit(this)\">");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<p class='field short'><label>水路</label><select id='calibrationZoneSelect' name='zoneId' onchange='calibrationProgressUpdate()'");
    if (!canStartCapture) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk(">");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& zone = ZoneManager::config(zoneId);
        Esp32BaseWeb::sendChunk("<option value='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'");
        if (zoneId == selectedZoneId) {
            Esp32BaseWeb::sendChunk(" selected");
        }
        if (!zone.enabled) {
            Esp32BaseWeb::sendChunk(" disabled");
        }
        Esp32BaseWeb::sendChunk(">");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk(zone.enabled ? "" : "（停用）");
        Esp32BaseWeb::sendChunk("</option>");
    }
    Esp32BaseWeb::sendChunk("</select></p><input type='submit' value='开始接水'");
    if (!canStartCapture) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></form><form class='calibration-inline-form");
    if (!canStopCapture) {
        Esp32BaseWeb::sendChunk(" calibration-stage-disabled");
    }
    Esp32BaseWeb::sendChunk("' method='post' action='/api/v1/calibration/stop' onsubmit=\"return once(this)&&calibrationSubmit(this)\">");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<input type='submit' value='停止并输入水量'");
    if (!canStopCapture) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></form></div><p class='calibration-stage-note'>");
    if (calibrationCapturing) {
        Esp32BaseWeb::sendChunk("接到目标水量后停止。");
    } else if (calibrationWaitingActual) {
        Esp32BaseWeb::sendChunk("已停止出水，请先保存本次实测水量。");
    } else if (calibrationSampleFull) {
        Esp32BaseWeb::sendChunk("当前样本数已达到配置容量；可生成候选参数，或清空样本后重新采集。");
    } else {
        Esp32BaseWeb::sendChunk("选择水路，准备量杯后开始接水。");
    }
    Esp32BaseWeb::sendChunk("</p></div><div class='calibration-stage'><h3>保存样本</h3><div class='calibration-stage-control'><form class='calibration-inline-form");
    if (!canSaveCaptureSample) {
        Esp32BaseWeb::sendChunk(" calibration-stage-disabled");
    }
    Esp32BaseWeb::sendChunk("' method='post' action='/api/v1/calibration/sample' onsubmit=\"return once(this)&&calibrationSubmit(this)\">");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<p class='field short'><label>实际水量 ml</label><input name='actualMl' type='number' min='1' max='100000' required");
    if (!canSaveCaptureSample) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></p><input type='submit' value='保存样本'");
    if (!canSaveCaptureSample) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></form></div><p class='calibration-stage-note'>");
    if (calibrationWaitingActual) {
        Esp32BaseWeb::sendChunk("输入量杯读数并保存，系统会记录本次样本。");
    } else if (calibrationCapturing) {
        Esp32BaseWeb::sendChunk("停止出水后在这里输入实际水量。");
    } else {
        Esp32BaseWeb::sendChunk("完成一次接水后在这里保存样本。");
    }
    Esp32BaseWeb::sendChunk("</p>");
    Esp32BaseWeb::sendChunk("</div></div><h3 class='calibration-section-title'>接水状态</h3><div id='calibrationProgress' class='calibration-progress calibration-collect-status'><span><b>水路</b><strong id='calibrationProgressZone'>");
    if (progressZoneId == 0) {
        Esp32BaseWeb::sendChunk("-");
    } else {
        Esp32BaseWeb::writeHtmlEscaped(ZoneManager::config(progressZoneId).name);
    }
    Esp32BaseWeb::sendChunk("</strong></span><span><b>状态</b><strong id='calibrationProgressState'>");
    Esp32BaseWeb::writeHtmlEscaped(calibrationStateLabel(FlowCalibration::state()));
    Esp32BaseWeb::sendChunk("</strong></span><span><b>已接水</b><strong id='calibrationProgressElapsed'>");
    writeDurationHuman((calibrationSnapshot.elapsedMs + 999UL) / 1000UL);
    Esp32BaseWeb::sendChunk("</strong></span><span><b>剩余最长</b><strong id='calibrationProgressRemaining'>");
    writeDurationHuman((calibrationSnapshot.remainingMs + 999UL) / 1000UL);
    Esp32BaseWeb::sendChunk("</strong></span><span><b>当前脉冲</b><strong id='calibrationProgressPulses'>");
    writeUInt(calibrationSnapshot.currentPulses);
    Esp32BaseWeb::sendChunk("</strong></span><span><b>估算水量</b><strong id='calibrationProgressEstimated'>");
    writeUInt(progressEstimatedMl);
    Esp32BaseWeb::sendChunk(" ml</strong></span><span><b>当前流速</b><strong id='calibrationProgressFlow'>");
    if (progressFlowReady) {
        writeFlowRate(progressFlowMlPerMin);
    } else {
        Esp32BaseWeb::sendChunk("等待窗口");
    }
    Esp32BaseWeb::sendChunk("</strong></span></div><h3 class='calibration-section-title'>当前水路参数</h3><div id='calibrationCurrentParams' class='calibration-current-params'><div class='calibration-param-card'><div class='calibration-param-head'><h4>当前参数</h4><span class='tag ok'>正在使用</span></div><div id='calibrationCurrentFlowText'>");
    writeFlowParameterCompact(selectedZone.flow);
    Esp32BaseWeb::sendChunk("</div></div><div class='calibration-param-card'><div class='calibration-param-head'><h4>候选参数</h4>");
    if (selectedZone.candidateFlow.exists) {
        Esp32BaseWeb::sendChunk(selectedCandidateMatches ? "<span class='tag'>与当前一致</span>" : "<span class='tag ok'>可设为当前</span>");
    }
    Esp32BaseWeb::sendChunk("</div><div id='calibrationCandidateFlowText'>");
    if (selectedZone.candidateFlow.exists) {
        writeFlowParameterCompact(selectedZone.candidateFlow.params);
        Esp32BaseWeb::sendChunk("</div>");
        Esp32BaseWeb::sendChunk("<p id='calibrationCurrentCandidateNote' class='calibration-param-note'>");
        Esp32BaseWeb::sendChunk(selectedCandidateMatches ? "候选参数与当前参数一致。" : "候选参数已保存，尚未设为当前。");
        Esp32BaseWeb::sendChunk("</p>");
    } else {
        Esp32BaseWeb::sendChunk("</div>");
        Esp32BaseWeb::sendChunk("<p id='calibrationCurrentCandidateNote' class='calibration-param-note'>暂无候选参数。</p>");
    }
    Esp32BaseWeb::sendChunk("</div></div><div class='calibration-panel-actions'>");
    const bool canCompute = FlowCalibration::validSampleCount() > 0;
    if (!canCompute) {
        Esp32BaseWeb::sendChunk("<span class='calibration-action-note'>至少需要 1 条有效样本才能生成候选参数。</span>");
    }
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/calibration/compute' onsubmit=\"return confirm('确认用当前样本生成候选参数？')&&once(this)&&calibrationSubmit(this)\">");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<input type='submit' value='生成候选参数'");
    if (!canCompute) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></form><form method='post' action='/api/v1/calibration/clear' onsubmit=\"return confirm('确认清空当前校准样本？')&&once(this)&&calibrationSubmit(this)\">");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<input class='secondary' type='submit' value='清空样本'></form></div></div>");
    Esp32BaseWeb::endPanel();

