tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
    Esp32BaseWeb::beginPanel("样本");
    Esp32BaseWeb::sendChunk("<div id='calibrationSamplesPanel'><dialog id='calibrationActualDialog' class='calibration-dialog'><form method='post' action='/api/v1/calibration/sample/update' onsubmit=\"return confirm('确认修改该样本实际水量？')&&once(this)&&calibrationSubmit(this)\"><input type='hidden' name='source' value='web_page'><input id='calibrationActualIndex' type='hidden' name='sampleIndex'><h3>修改实际水量</h3><p class='field short'><label>实际水量 ml</label><input id='calibrationActualInput' name='actualMl' type='number' min='1' max='100000' required></p><div class='actions'><input type='submit' value='保存修改'><button class='btnlink secondary' type='button' onclick='document.getElementById(\"calibrationActualDialog\").close()'>取消</button></div></form></dialog>");
    Esp32BaseWeb::sendChunk("<div class='calibration-sample-head'><span class='calibration-sample-summary'>已保存 ");
    writeUInt(FlowCalibration::sampleCount());
    Esp32BaseWeb::sendChunk(" 条 · 有效 ");
    writeUInt(FlowCalibration::validSampleCount());
    Esp32BaseWeb::sendChunk(" 条 · 容量 ");
    writeUInt(system.calibrationSampleTarget);
    Esp32BaseWeb::sendChunk(" 条</span></div>");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>#</th><th>水路</th><th>状态</th><th>实际水量</th><th>总脉冲</th><th>时长</th><th>稳定开始</th><th>启动脉冲</th><th>波动</th><th>操作</th></tr></thead><tbody>");
    for (uint8_t i = 0; i < FlowCalibration::sampleCount(); ++i) {
        const FlowCalibration::Sample& sample = FlowCalibration::sample(i);
        Esp32BaseWeb::sendChunk("<tr><td>");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(sample.zoneId);
        Esp32BaseWeb::sendChunk("</td><td>");
        if (sample.valid) {
            Esp32BaseWeb::sendChunk(sample.stableDetected ? "有效" : "有效，未识别稳定点");
        } else {
            Esp32BaseWeb::writeHtmlEscaped(sample.invalidReason);
        }
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(sample.actualMl);
        Esp32BaseWeb::sendChunk(" ml</td><td>");
        writeUInt(sample.totalPulses);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeDurationMsHumanCompact(sample.durationMs);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeDurationMsHumanCompact(sample.stableStartMs);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(sample.startupPulseInSample);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(sample.rateVariationPermille);
        Esp32BaseWeb::sendChunk("‰</td><td><div class='calibration-sample-actions'><button class='btnlink compact secondary' type='button' onclick='calibrationEditActual(");
        writeUInt(i);
        Esp32BaseWeb::sendChunk(",");
        writeUInt(sample.actualMl);
        Esp32BaseWeb::sendChunk(")'>修改</button><a class='btnlink compact' href='/irrigation/calibration/sample?index=");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk("'>详情</a></div></td></tr>");
    }
    if (FlowCalibration::sampleCount() == 0) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='10'>暂无样本</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div></div>");
    Esp32BaseWeb::endPanel();

    const FlowCalibration::Recommendation& rec = FlowCalibration::recommendation();
    Esp32BaseWeb::sendChunk("<div id='calibrationRecommendationPanel'>");
    if (rec.valid) {
        Esp32BaseWeb::beginPanel();
        Esp32BaseWeb::sendChunk("<h2>候选参数诊断：");
        if (Irrigation::validZoneId(rec.zoneId)) {
            Esp32BaseWeb::writeHtmlEscaped(ZoneManager::config(rec.zoneId).name);
        } else {
            Esp32BaseWeb::sendChunk("未知水路");
        }
        Esp32BaseWeb::sendChunk("</h2>");
        Esp32BaseWeb::sendChunk("<div class='calibration-note'><b>运行估算公式</b><br><code>P</code> 为总脉冲，<code>S</code> 为启动阶段脉冲，<code>V0</code> 为启动阶段水量，<code>K</code> 为稳定脉冲 P/L。<br>未过启动阶段：<code>P <= S，水量 = P × V0 / S</code>。<br>超过启动阶段：<code>P > S，水量 = V0 + (P - S) × 1000 / K</code>。</div>");
        Esp32BaseWeb::sendChunk("<div class='calibration-note'><b>参数生成算法</b><br>系统从样本脉冲时间差还原时间线，用 2 秒窗口、200 ms 步进扫描流速，找到连续稳定的起点；稳定起点前的脉冲数作为启动阶段参考。多个样本取中位数附近搜索候选启动脉冲，并拟合启动阶段水量和稳定脉冲 P/L，选择平均误差和最大误差最小的一组。</div>");
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><tbody><tr><th>水路</th><td>");
        writeUInt(rec.zoneId);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>启动阶段脉冲</th><td>");
        writeUInt(rec.flow.startupPulseLimit);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>启动阶段水量</th><td>");
        writeUInt(rec.flow.startupEstimatedMl);
        Esp32BaseWeb::sendChunk(" ml</td></tr><tr><th>稳定脉冲 P/L</th><td>");
        writeUInt(rec.flow.stablePulsePerLiter);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>有效样本数</th><td>");
        writeUInt(rec.sampleCount);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>稳定点识别</th><td>");
        writeUInt(rec.stableDetectedCount);
        Esp32BaseWeb::sendChunk(" / ");
        writeUInt(rec.sampleCount);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>水量跨度</th><td>");
        writePermilleAsPercent(rec.volumeSpanPermille);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>脉冲跨度</th><td>");
        writePermilleAsPercent(rec.pulseSpanPermille);
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>样本内平均误差</th><td>");
        if (rec.sampleCount < 2) {
            Esp32BaseWeb::sendChunk("无法评估");
        } else {
            writePermilleAsPercent(rec.averageErrorPermille);
        }
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>样本内最大误差</th><td>");
        if (rec.sampleCount < 2) {
            Esp32BaseWeb::sendChunk("无法评估");
        } else {
            writePermilleAsPercent(rec.maxErrorPermille);
        }
        Esp32BaseWeb::sendChunk("</td></tr><tr><th>建议</th><td>");
        Esp32BaseWeb::writeHtmlEscaped(calibrationRecommendationAdvice(rec));
        Esp32BaseWeb::sendChunk("</td></tr></tbody></table></div>");
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>样本</th><th>实际</th><th>估算</th><th>误差</th></tr></thead><tbody>");
        for (uint8_t i = 0; i < rec.sampleCount; ++i) {
            Esp32BaseWeb::sendChunk("<tr><td>");
            writeUInt(rec.errors[i].sampleIndex + 1);
            Esp32BaseWeb::sendChunk("</td><td>");
            writeUInt(rec.errors[i].actualMl);
            Esp32BaseWeb::sendChunk(" ml</td><td>");
            writeUInt(rec.errors[i].estimatedMl);
            Esp32BaseWeb::sendChunk(" ml</td><td>");
            if (rec.errors[i].errorMl < 0) {
                Esp32BaseWeb::sendChunk("-");
                writeUInt(static_cast<uint32_t>(-rec.errors[i].errorMl));
            } else {
                writeUInt(static_cast<uint32_t>(rec.errors[i].errorMl));
            }
            Esp32BaseWeb::sendChunk(" ml / ");
            writeUInt(rec.errors[i].errorPermille);
            Esp32BaseWeb::sendChunk("‰</td></tr>");
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div><p class='calibration-param-note'>以上诊断对应最近一次生成的候选参数，可在本水路参数行中设为当前。</p>");
        Esp32BaseWeb::endPanel();
    }
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::sendChunk("<script>"
                            "function calibrationText(id,v){var e=document.getElementById(id);if(e)e.textContent=v;}"
                            "function calibrationDuration(s){s=Number(s)||0;var m=Math.floor(s/60),r=s%60;return m>0?(m+'分钟'+(r>0?String(r)+'秒':'')):s+'秒';}"
                            "function calibrationMl(v){v=Number(v)||0;return v>=1000?(Math.floor(v/1000)+'.'+String(v%1000).padStart(3,'0')+' L'):(v+' ml');}"
                            "function calibrationFlow(v,ready){return ready?calibrationMl(v)+'/min':'等待窗口';}"
                            "function calibrationParamText(p){if(!p)return '-';return '启动 '+(p.startupPulseLimit||0)+'P · '+(p.startupEstimatedMl||0)+' ml · 稳定 '+(p.stablePulsePerLiter||0)+' P/L';}"
                            "function calibrationSelectedZone(){var s=document.getElementById('calibrationZoneSelect');return s&&s.value?s.value:'';}"
                            "function calibrationProgressUpdate(){if(!window.fetch)return;var z=calibrationSelectedZone(),u='/api/v1/calibration/status'+(z?('?zoneId='+encodeURIComponent(z)):'');fetch(u,{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.ok?r.json():null;}).then(function(d){if(!d||!d.ok)return;calibrationText('calibrationProgressZone',d.zoneId?(d.zoneName||('Zone '+d.zoneId)):'-');calibrationText('calibrationProgressState',d.stateLabel||'-');calibrationText('calibrationProgressElapsed',calibrationDuration(d.elapsedSec));calibrationText('calibrationProgressRemaining',calibrationDuration(d.remainingSec));calibrationText('calibrationProgressPulses',String(d.currentPulses||0));calibrationText('calibrationProgressEstimated',calibrationMl(d.estimatedMl));calibrationText('calibrationProgressFlow',calibrationFlow(d.flowMlPerMin,d.flowRateReady));calibrationText('calibrationCurrentFlowText',calibrationParamText(d.currentFlow));if(d.candidateFlow&&d.candidateFlow.exists){calibrationText('calibrationCandidateFlowText',calibrationParamText(d.candidateFlow.params));calibrationText('calibrationCurrentCandidateNote',d.candidateFlow.matchesCurrent?'候选参数与当前参数一致。':'候选参数已保存，尚未设为当前。');}else{calibrationText('calibrationCandidateFlowText','');calibrationText('calibrationCurrentCandidateNote','暂无候选参数。');}}).catch(function(){});}"
                            "function calibrationReplaceSections(doc){['calibrationParamPanel','calibrationCollectPanel','calibrationSamplesPanel','calibrationRecommendationPanel'].forEach(function(id){var a=document.getElementById(id),b=doc.getElementById(id);if(a&&b)a.outerHTML=b.outerHTML;});}"
                            "function calibrationRefreshSections(){return fetch('/irrigation/calibration',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.text();}).then(function(html){var doc=new DOMParser().parseFromString(html,'text/html');calibrationReplaceSections(doc);calibrationProgressUpdate();});}"
                            "function calibrationSubmit(f){if(!window.fetch)return true;var b=f.querySelector('[type=submit]');fetch(f.action,{method:'POST',headers:{'X-Esp32Base-Ajax':'1','Accept':'application/json','Content-Type':'application/x-www-form-urlencoded'},body:new URLSearchParams(new FormData(f)).toString(),credentials:'same-origin'}).then(function(r){return r.json().then(function(j){j.status=r.status;return j;});}).then(function(j){if(!j.ok){alert(j.error||'操作失败');return;}return calibrationRefreshSections();}).catch(function(){alert('请求失败');}).finally(function(){delete f.dataset.busy;if(b)b.disabled=false;});return false;}"
                            "function calibrationEditActual(i,ml){var d=document.getElementById('calibrationActualDialog');document.getElementById('calibrationActualIndex').value=String(i);document.getElementById('calibrationActualInput').value=String(ml||'');if(d.showModal)d.showModal();else d.setAttribute('open','open');}"
                            "function calibrationProgressStart(){calibrationProgressUpdate();setInterval(calibrationProgressUpdate,1000);}"
                            "if(document.getElementById('calibrationProgress'))calibrationProgressStart();"
                            "</script>");
    pageFooter();
}

