tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void handleConfigApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        const Irrigation::SystemConfig& system = SystemConfigStore::current();
        beginJson(200);
        Esp32BaseWeb::sendChunk("{\"ok\":true,\"system\":{\"maxWateringDurationSec\":");
        writeUInt(system.maxWateringDurationSec);
        Esp32BaseWeb::sendChunk(",\"scheduleGraceSec\":");
        writeUInt(system.scheduleGraceSec);
        Esp32BaseWeb::sendChunk(",\"manualDefaultDurationSec\":");
        writeUInt(system.manualDefaultDurationSec);
        Esp32BaseWeb::sendChunk(",\"idleLeakDetectionEnabled\":");
        writeBool(system.idleLeakDetectionEnabled);
        Esp32BaseWeb::sendChunk(",\"idleLeakWindowSec\":");
        writeUInt(system.idleLeakWindowSec);
        Esp32BaseWeb::sendChunk(",\"idleLeakPulseThreshold\":");
        writeUInt(system.idleLeakPulseThreshold);
        Esp32BaseWeb::sendChunk(",\"calibrationSampleTarget\":");
        writeUInt(system.calibrationSampleTarget);
        Esp32BaseWeb::sendChunk(",\"calibrationMaxCaptureMin\":");
        writeUInt(system.calibrationMaxCaptureMin);
        Esp32BaseWeb::sendChunk(",\"calibrationDetailCaptureSec\":");
        writeUInt(system.calibrationDetailCaptureSec);
        Esp32BaseWeb::sendChunk(",\"calibrationDetailPulseLimit\":");
        writeUInt(system.calibrationDetailPulseLimit);
        Esp32BaseWeb::sendChunk(",\"flowRateWindowSec\":");
        writeUInt(system.flowRateWindowSec);
        Esp32BaseWeb::sendChunk(",\"flowChartIntervalSec\":");
        writeUInt(system.flowChartIntervalSec);
        Esp32BaseWeb::sendChunk(",\"flowChartHistoryMin\":");
        writeUInt(system.flowChartHistoryMin);
        Esp32BaseWeb::sendChunk(",\"durationPresets\":[");
        for (uint8_t i = 0; i < 6; ++i) {
            if (i) Esp32BaseWeb::sendChunk(",");
            writeUInt(system.durationPresets[i]);
        }
        Esp32BaseWeb::sendChunk("]}}");
        endJson();
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("GET,POST");
        return;
    }
    if (!checkBusinessPost("irrigation.config")) {
        return;
    }
    Irrigation::SystemConfig system = SystemConfigStore::current();
    if (Esp32BaseWeb::hasParam("maxWateringDurationSec") && !readU32("maxWateringDurationSec", &system.maxWateringDurationSec)) sendError(400, "invalid_max_duration");
    else if (Esp32BaseWeb::hasParam("scheduleGraceSec") && !readU16("scheduleGraceSec", &system.scheduleGraceSec)) sendError(400, "invalid_schedule_grace");
    else if (Esp32BaseWeb::hasParam("manualDefaultDurationSec") && !readU32("manualDefaultDurationSec", &system.manualDefaultDurationSec)) sendError(400, "invalid_manual_default");
    else if (Esp32BaseWeb::hasParam("idleLeakDetectionEnabled") && !readBool("idleLeakDetectionEnabled", &system.idleLeakDetectionEnabled)) sendError(400, "invalid_leak_enabled");
    else if (Esp32BaseWeb::hasParam("idleLeakWindowSec") && !readU16("idleLeakWindowSec", &system.idleLeakWindowSec)) sendError(400, "invalid_leak_window");
    else if (Esp32BaseWeb::hasParam("idleLeakPulseThreshold") && !readU16("idleLeakPulseThreshold", &system.idleLeakPulseThreshold)) sendError(400, "invalid_leak_threshold");
    else if (Esp32BaseWeb::hasParam("calibrationSampleTarget") && !readU8("calibrationSampleTarget", &system.calibrationSampleTarget)) sendError(400, "invalid_calibration_sample_target");
    else if (Esp32BaseWeb::hasParam("calibrationMaxCaptureMin") && !readU16("calibrationMaxCaptureMin", &system.calibrationMaxCaptureMin)) sendError(400, "invalid_calibration_max_capture");
    else if (Esp32BaseWeb::hasParam("calibrationDetailCaptureSec") && !readU16("calibrationDetailCaptureSec", &system.calibrationDetailCaptureSec)) sendError(400, "invalid_calibration_detail_capture");
    else if (Esp32BaseWeb::hasParam("calibrationDetailPulseLimit") && !readU16("calibrationDetailPulseLimit", &system.calibrationDetailPulseLimit)) sendError(400, "invalid_calibration_detail_pulses");
    else if (Esp32BaseWeb::hasParam("flowRateWindowSec") && !readU16("flowRateWindowSec", &system.flowRateWindowSec)) sendError(400, "invalid_flow_rate_window");
    else if (Esp32BaseWeb::hasParam("flowChartIntervalSec") && !readU16("flowChartIntervalSec", &system.flowChartIntervalSec)) sendError(400, "invalid_flow_chart_interval");
    else if (Esp32BaseWeb::hasParam("flowChartHistoryMin") && !readU16("flowChartHistoryMin", &system.flowChartHistoryMin)) sendError(400, "invalid_flow_chart_history");
    else {
        bool parsed = true;
        for (uint8_t i = 0; i < 6; ++i) {
            char key[12];
            snprintf(key, sizeof(key), "preset%u", static_cast<unsigned>(i));
            if (Esp32BaseWeb::hasParam(key) && !readU32(key, &system.durationPresets[i])) {
                parsed = false;
            }
        }
        if (!parsed) {
            sendError(400, "invalid_preset");
        } else if (!SystemConfigStore::set(system)) {
            sendError(400, "invalid_system_config");
        } else {
            redirectOrOk("/esp32base/app-config");
        }
    }
}

void handleCalibrationStartApi() {
    if (!checkBusinessPost("irrigation.calibration.start")) {
        return;
    }
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone");
        return;
    }
    if (!FlowCalibration::start(zoneId, SystemConfigStore::current())) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationStopApi() {
    if (!checkBusinessPost("irrigation.calibration.stop")) {
        return;
    }
    if (!FlowCalibration::stop()) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationSampleApi() {
    if (!checkBusinessPost("irrigation.calibration.sample")) {
        return;
    }
    uint32_t actualMl = 0;
    if (!readU32("actualMl", &actualMl) || actualMl == 0) {
        sendError(400, "invalid_actual_ml");
        return;
    }
    if (!FlowCalibration::submitActualMilliliters(actualMl)) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationSampleUpdateApi() {
    if (!checkBusinessPost("irrigation.calibration.sample_update")) {
        return;
    }
    uint8_t sampleIndex = 0;
    uint32_t actualMl = 0;
    if (!readU8("sampleIndex", &sampleIndex) ||
        !readU32("actualMl", &actualMl) ||
        actualMl == 0) {
        sendError(400, "invalid_sample_update");
        return;
    }
    if (!FlowCalibration::updateActualMilliliters(sampleIndex, actualMl)) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationComputeApi() {
    if (!checkBusinessPost("irrigation.calibration.compute")) {
        return;
    }
    FlowCalibration::Recommendation rec = {};
    if (!FlowCalibration::computeRecommendation(&rec)) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    if (!FlowCalibration::saveCandidate()) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationCandidateSaveApi() {
    if (!checkBusinessPost("irrigation.calibration.candidate_save")) {
        return;
    }
    uint8_t zoneId = 0;
    Irrigation::FlowParameters params = {};
    if (!readZoneId(&zoneId) || !readFlowParameters(&params)) {
        sendError(400, "invalid_candidate");
        return;
    }
    if (!ZoneConfigStore::saveCandidate(zoneId, params)) {
        sendError(400, "candidate_save_failed");
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationApplyApi() {
    if (!checkBusinessPost("irrigation.calibration.apply")) {
        return;
    }
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone");
        return;
    }
    if (FlowCalibration::active()) {
        sendError(409, "calibration_busy");
        return;
    }
    if (ZoneManager::isZoneBusy(zoneId)) {
        sendError(409, "zone_busy");
        return;
    }
    const Irrigation::ZoneConfig& before = ZoneConfigStore::get(zoneId);
    if (!before.candidateFlow.exists) {
        sendError(409, "no_candidate");
        return;
    }
    if (ZoneConfigStore::flowParametersEqual(before.flow, before.candidateFlow.params)) {
        sendError(409, "candidate_unchanged");
        return;
    }
    Irrigation::FlowParameters oldParams = {};
    Irrigation::FlowParameters newParams = {};
    if (!ZoneConfigStore::applyCandidate(zoneId, &oldParams, &newParams)) {
        sendError(409, "candidate_apply_failed");
        return;
    }
    (void)ZoneManager::reloadZone(zoneId);
    BusinessEventLog::appendFlowCandidateApplied(zoneId, oldParams, newParams, wantsRedirect() ? "web" : "api");
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationPreviousRestoreApi() {
    if (!checkBusinessPost("irrigation.calibration.previous_restore")) {
        return;
    }
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone");
        return;
    }
    if (FlowCalibration::active()) {
        sendError(409, "calibration_busy");
        return;
    }
    if (ZoneManager::isZoneBusy(zoneId)) {
        sendError(409, "zone_busy");
        return;
    }
    Irrigation::FlowParameters oldParams = {};
    Irrigation::FlowParameters newParams = {};
    if (!ZoneConfigStore::restorePrevious(zoneId, &oldParams, &newParams)) {
        sendError(409, "previous_restore_failed");
        return;
    }
    (void)ZoneManager::reloadZone(zoneId);
    BusinessEventLog::appendFlowPreviousRestored(zoneId, oldParams, newParams, wantsRedirect() ? "web" : "api");
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationClearApi() {
    if (!checkBusinessPost("irrigation.calibration.clear")) {
        return;
    }
    (void)FlowCalibration::clear();
    redirectOrOk("/irrigation/calibration");
}

void handleZoneStartApi() {
    if (!checkBusinessPost("irrigation.zone.start")) {
        return;
    }
    uint8_t zoneId = 0;
    uint32_t durationSec = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_start_request");
        return;
    }
    if (Esp32BaseWeb::hasParam("durationMin")) {
        uint32_t durationMin = 0;
        if (!readU32("durationMin", &durationMin) || durationMin == 0 || durationMin > (SystemConfigStore::current().maxWateringDurationSec / 60UL)) {
            sendError(400, "invalid_start_duration");
            return;
        }
        durationSec = durationMin * 60UL;
    } else if (!readU32("durationSec", &durationSec)) {
        sendError(400, "invalid_start_request");
        return;
    }
    if (!ZoneManager::startManual(zoneId, durationSec, startSourceFromRequest())) {
        sendError(409, "zone_start_rejected");
        return;
    }
    redirectOrOk();
}

