tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void handleScheduleSkipApi(bool skip) {
    if (!checkBusinessPost(skip ? "irrigation.schedule.skip" : "irrigation.schedule.unskip")) {
        return;
    }
    uint32_t planId = 0;
    uint32_t ymd = 0;
    uint8_t reasonRaw = 0;
    if (!readU32("planId", &planId) || !readYmd("ymd", &ymd)) {
        sendError(400, "invalid_skip_request");
        return;
    }
    if (!Esp32BaseWeb::hasParam("reason")) {
        reasonRaw = static_cast<uint8_t>(Irrigation::SkipReason::MANUAL);
    } else if (!readU8("reason", &reasonRaw) || reasonRaw > static_cast<uint8_t>(Irrigation::SkipReason::WEATHER)) {
        sendError(400, "invalid_skip_reason");
        return;
    }
    const bool ok = skip
        ? ScheduleSkipStore::skip(planId, ymd, static_cast<Irrigation::SkipReason>(reasonRaw))
        : ScheduleSkipStore::unskip(planId, ymd);
    if (!ok) {
        sendError(400, "skip_update_failed");
        return;
    }
    BusinessEventLog::appendScheduleSkipDecision(planId,
                                                 ymd,
                                                 static_cast<Irrigation::SkipReason>(reasonRaw),
                                                 skip,
                                                 wantsRedirect() ? "web" : "api");
    redirectOrOk("/irrigation/plans");
}

void handleScheduleSkipApi() {
    handleScheduleSkipApi(true);
}

void handleScheduleUnskipApi() {
    handleScheduleSkipApi(false);
}

void handleWeatherSnapshotApi() {
    if (!checkBusinessPost("irrigation.weather.snapshot")) {
        return;
    }

    WeatherSnapshotStore::Snapshot snapshot = {};
    snapshot.exists = true;

    if (!readU32("updatedEpoch", &snapshot.updatedEpoch) ||
        !readI16("currentTempC", &snapshot.currentTempC) ||
        !readTextParam("condition", snapshot.condition, sizeof(snapshot.condition)) ||
        !readU8("rainProbability24hPercent", &snapshot.rainProbability24hPercent) ||
        !readU8("windLevel", &snapshot.windLevel)) {
        sendError(400, "invalid_weather_snapshot");
        return;
    }

    static constexpr const char* kLabels[] = {"today", "tomorrow", "dayAfter"};
    for (uint8_t i = 0; i < 3; ++i) {
        char name[40];
        snprintf(name, sizeof(name), "%sLabel", kLabels[i]);
        if (!readTextParam(name, snapshot.days[i].label, sizeof(snapshot.days[i].label))) {
            sendError(400, "invalid_weather_day");
            return;
        }
        snprintf(name, sizeof(name), "%sLowTempC", kLabels[i]);
        if (!readI16(name, &snapshot.days[i].lowTempC)) {
            sendError(400, "invalid_weather_day");
            return;
        }
        snprintf(name, sizeof(name), "%sHighTempC", kLabels[i]);
        if (!readI16(name, &snapshot.days[i].highTempC)) {
            sendError(400, "invalid_weather_day");
            return;
        }
        snprintf(name, sizeof(name), "%sRainProbabilityPercent", kLabels[i]);
        if (!readU8(name, &snapshot.days[i].rainProbabilityPercent)) {
            sendError(400, "invalid_weather_day");
            return;
        }
    }

    if (!WeatherSnapshotStore::set(snapshot)) {
        sendError(400, "invalid_weather_snapshot");
        return;
    }
    sendOk();
}

void handleRecordsApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    beginJson(200);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"count\":");
    writeUInt(RecordStore::count());
    Esp32BaseWeb::sendChunk(",\"capacity\":");
    writeUInt(RecordStore::capacity());
    Esp32BaseWeb::sendChunk(",\"records\":[");
    RecordJsonContext ctx = {true};
    (void)RecordStore::readLatest(0, 50, writeRecordJson, &ctx);
    Esp32BaseWeb::sendChunk("]}");
    endJson();
}

void handleEventsApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    beginJson(200);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"count\":");
    writeUInt(Esp32BaseAppEventLog::count());
    Esp32BaseWeb::sendChunk(",\"capacity\":");
    writeUInt(Esp32BaseAppEventLog::capacity());
    Esp32BaseWeb::sendChunk(",\"events\":[");
    EventJsonContext ctx = {true};
    (void)Esp32BaseAppEventLog::readLatest(0, 50, writeEventJson, &ctx);
    Esp32BaseWeb::sendChunk("]}");
    endJson();
}

}

namespace IrrigationWeb {

void begin() {
    const bool overviewOk = Esp32BaseWeb::addPage("/index", "首页", handleOverviewPage);
    const bool plansOk = Esp32BaseWeb::addPage("/irrigation/plans", "计划", handlePlansPage);
    const bool recordsPageOk = Esp32BaseWeb::addPage("/irrigation/records", "浇水记录", handleRecordsPage);
    const bool eventsPageOk = Esp32BaseWeb::addPage("/irrigation/events", "事件记录", handleEventsPage);
    const bool calibrationPageOk = Esp32BaseWeb::addPage("/irrigation/calibration", "流量校准", handleCalibrationPage);
    const bool settingsOk = Esp32BaseWeb::addPage("/irrigation/zones", "水路管理", handleSettingsPage);
    const bool calibrationSamplePageOk = Esp32BaseWeb::addRoute("/irrigation/calibration/sample", Esp32BaseWeb::METHOD_GET, handleCalibrationSampleDetailPage);
    const bool eventDetailPageOk = Esp32BaseWeb::addRoute("/irrigation/events/detail", Esp32BaseWeb::METHOD_GET, handleEventDetailPage);
    const bool planEditOk = Esp32BaseWeb::addRoute("/irrigation/plan", Esp32BaseWeb::METHOD_GET, handlePlanEditPage);
    const bool statusOk = Esp32BaseWeb::addRoute("/api/v1/status", Esp32BaseWeb::METHOD_GET, handleStatusApi);
    const bool flowHistoryOk = Esp32BaseWeb::addRoute("/api/v1/flow/history", Esp32BaseWeb::METHOD_GET, handleFlowHistoryApi);
    const bool calibrationStatusOk = Esp32BaseWeb::addRoute("/api/v1/calibration/status", Esp32BaseWeb::METHOD_GET, handleCalibrationStatusApi);
    const bool configOk = Esp32BaseWeb::addApi("/api/v1/config", handleConfigApi);
    const bool zoneStartOk = Esp32BaseWeb::addRoute("/api/v1/zone/start", Esp32BaseWeb::METHOD_POST, handleZoneStartApi);
    const bool zoneStopOk = Esp32BaseWeb::addRoute("/api/v1/zone/stop", Esp32BaseWeb::METHOD_POST, handleZoneStopApi);
    const bool allStopOk = Esp32BaseWeb::addRoute("/api/v1/zones/stop-all", Esp32BaseWeb::METHOD_POST, handleZonesStopAllApi);
    const bool zoneConfigOk = Esp32BaseWeb::addRoute("/api/v1/zone/config", Esp32BaseWeb::METHOD_POST, handleZoneConfigApi);
    const bool clearErrorOk = Esp32BaseWeb::addRoute("/api/v1/zone/clear-error", Esp32BaseWeb::METHOD_POST, handleZoneClearErrorApi);
    const bool calibrationStartOk = Esp32BaseWeb::addRoute("/api/v1/calibration/start", Esp32BaseWeb::METHOD_POST, handleCalibrationStartApi);
    const bool calibrationStopOk = Esp32BaseWeb::addRoute("/api/v1/calibration/stop", Esp32BaseWeb::METHOD_POST, handleCalibrationStopApi);
    const bool calibrationSampleOk = Esp32BaseWeb::addRoute("/api/v1/calibration/sample", Esp32BaseWeb::METHOD_POST, handleCalibrationSampleApi);
    const bool calibrationSampleUpdateOk = Esp32BaseWeb::addRoute("/api/v1/calibration/sample/update", Esp32BaseWeb::METHOD_POST, handleCalibrationSampleUpdateApi);
    const bool calibrationComputeOk = Esp32BaseWeb::addRoute("/api/v1/calibration/compute", Esp32BaseWeb::METHOD_POST, handleCalibrationComputeApi);
    const bool calibrationCandidateSaveOk = Esp32BaseWeb::addRoute("/api/v1/calibration/candidate", Esp32BaseWeb::METHOD_POST, handleCalibrationCandidateSaveApi);
    const bool calibrationApplyOk = Esp32BaseWeb::addRoute("/api/v1/calibration/apply", Esp32BaseWeb::METHOD_POST, handleCalibrationApplyApi);
    const bool calibrationRestoreOk = Esp32BaseWeb::addRoute("/api/v1/calibration/previous/restore", Esp32BaseWeb::METHOD_POST, handleCalibrationPreviousRestoreApi);
    const bool calibrationClearOk = Esp32BaseWeb::addRoute("/api/v1/calibration/clear", Esp32BaseWeb::METHOD_POST, handleCalibrationClearApi);
    const bool plansApiOk = Esp32BaseWeb::addRoute("/api/v1/plans", Esp32BaseWeb::METHOD_GET, handlePlansApi);
    const bool planCreateOk = Esp32BaseWeb::addRoute("/api/v1/plan/create", Esp32BaseWeb::METHOD_POST, handlePlanCreateApi);
    const bool planUpdateOk = Esp32BaseWeb::addRoute("/api/v1/plan/update", Esp32BaseWeb::METHOD_POST, handlePlanUpdateApi);
    const bool planDeleteOk = Esp32BaseWeb::addRoute("/api/v1/plan/delete", Esp32BaseWeb::METHOD_POST, handlePlanDeleteApi);
    const bool planEnableOk = Esp32BaseWeb::addRoute("/api/v1/plan/enable", Esp32BaseWeb::METHOD_POST, handlePlanEnableApi);
    const bool planDisableOk = Esp32BaseWeb::addRoute("/api/v1/plan/disable", Esp32BaseWeb::METHOD_POST, handlePlanDisableApi);
    const bool skipOk = Esp32BaseWeb::addRoute("/api/v1/schedule/skip", Esp32BaseWeb::METHOD_POST, handleScheduleSkipApi);
    const bool unskipOk = Esp32BaseWeb::addRoute("/api/v1/schedule/unskip", Esp32BaseWeb::METHOD_POST, handleScheduleUnskipApi);
    const bool recordsOk = Esp32BaseWeb::addRoute("/api/v1/records", Esp32BaseWeb::METHOD_GET, handleRecordsApi);
    const bool eventsOk = Esp32BaseWeb::addRoute("/api/v1/events", Esp32BaseWeb::METHOD_GET, handleEventsApi);
    const bool weatherOk = Esp32BaseWeb::addRoute("/api/v1/weather/snapshot", Esp32BaseWeb::METHOD_POST, handleWeatherSnapshotApi);
    const bool routeResults[] = {
        overviewOk, plansOk, recordsPageOk, eventsPageOk, calibrationPageOk, settingsOk,
        calibrationSamplePageOk, eventDetailPageOk, planEditOk, statusOk, flowHistoryOk, calibrationStatusOk, configOk,
        zoneStartOk, zoneStopOk, allStopOk, zoneConfigOk, clearErrorOk,
        calibrationStartOk, calibrationStopOk, calibrationSampleOk, calibrationSampleUpdateOk,
        calibrationComputeOk, calibrationCandidateSaveOk, calibrationApplyOk, calibrationRestoreOk,
        calibrationClearOk, plansApiOk, planCreateOk, planUpdateOk, planDeleteOk,
        planEnableOk, planDisableOk, skipOk, unskipOk, recordsOk, eventsOk, weatherOk,
    };
    uint8_t failedRoutes = 0;
    for (uint8_t i = 0; i < sizeof(routeResults) / sizeof(routeResults[0]); ++i) {
        if (!routeResults[i]) {
            ++failedRoutes;
        }
    }
    if (failedRoutes > 0) {
        BusinessEventLog::appendWebRouteRegistrationFailed(failedRoutes);
    }
    ESP32BASE_LOG_I("irrigation.web", "routes overview=%s plans=%s zones=%s calibration=%s calSamplePage=%s recordsPage=%s eventsPage=%s eventDetailPage=%s planEdit=%s status=%s flowHistory=%s calStatus=%s config=%s zoneStart=%s zoneStop=%s allStop=%s zoneConfig=%s clearError=%s calStart=%s calStop=%s calSample=%s calSampleUpdate=%s calCompute=%s calCandidateSave=%s calApply=%s calRestore=%s calClear=%s plansApi=%s planCreate=%s planUpdate=%s planDelete=%s planEnable=%s planDisable=%s skip=%s unskip=%s records=%s events=%s weather=%s firmware=%s",
                    overviewOk ? "ok" : "fail",
                    plansOk ? "ok" : "fail",
                    settingsOk ? "ok" : "fail",
                    calibrationPageOk ? "ok" : "fail",
                    calibrationSamplePageOk ? "ok" : "fail",
                    recordsPageOk ? "ok" : "fail",
                    eventsPageOk ? "ok" : "fail",
                    eventDetailPageOk ? "ok" : "fail",
                    planEditOk ? "ok" : "fail",
                    statusOk ? "ok" : "fail",
                    flowHistoryOk ? "ok" : "fail",
                    calibrationStatusOk ? "ok" : "fail",
                    configOk ? "ok" : "fail",
                    zoneStartOk ? "ok" : "fail",
                    zoneStopOk ? "ok" : "fail",
                    allStopOk ? "ok" : "fail",
                    zoneConfigOk ? "ok" : "fail",
                    clearErrorOk ? "ok" : "fail",
                    calibrationStartOk ? "ok" : "fail",
                    calibrationStopOk ? "ok" : "fail",
                    calibrationSampleOk ? "ok" : "fail",
                    calibrationSampleUpdateOk ? "ok" : "fail",
                    calibrationComputeOk ? "ok" : "fail",
                    calibrationCandidateSaveOk ? "ok" : "fail",
                    calibrationApplyOk ? "ok" : "fail",
                    calibrationRestoreOk ? "ok" : "fail",
                    calibrationClearOk ? "ok" : "fail",
                    plansApiOk ? "ok" : "fail",
                    planCreateOk ? "ok" : "fail",
                    planUpdateOk ? "ok" : "fail",
                    planDeleteOk ? "ok" : "fail",
                    planEnableOk ? "ok" : "fail",
                    planDisableOk ? "ok" : "fail",
                    skipOk ? "ok" : "fail",
                    unskipOk ? "ok" : "fail",
                    recordsOk ? "ok" : "fail",
                    eventsOk ? "ok" : "fail",
                    weatherOk ? "ok" : "fail",
                    IrrigationVersion::FirmwareVersion);
}

}
